{
    "version": "https://jsonfeed.org/version/1",
    "title": "Eyup Sukru Ergin&apos;s Intelligence Blog",
    "home_page_url": "http://localhost:4000/",
    "feed_url": "http://localhost:4000/feed.json",
    "description": "Welcome to my blog where I share my research on Military and Cyber ​​Threat Intelligence.",
    "icon": "http://localhost:4000/apple-touch-icon.png",
    "favicon": "http://localhost:4000/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "Eyup Sukru Ergin",
        "url": "https://ergin.dev/about",
        "avatar": null
    },
    
"items": [
    
        {
            "id": "http://localhost:4000/",
            "title": "➔ Intelligence 101:",
            "summary": null,
            "content_text": "",
            "content_html": "",
            "url": "http://localhost:4000/",
            
            
            
            
            
            "date_published": "2023-06-30T00:00:00+03:00",
            "date_modified": "2023-06-30T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/types-of-intelligence-by-scale/",
            "title": "Types of Intelligence by Scale",
            "summary": null,
            "content_text": "  Hello everyone! I am here with the last article of the basic intelligence series, intelligence types according to their scales. Good reading.SummaryIn the previous article, the intelligence series according to their fields, we have elaborated and exemplified the subjects and branches of intelligence according to their fields. Today, I will show you the classification of intelligence types according to their scales and how this classification can create differences on a user basis. So, without further ado, let’s get to the point.Intelligence by ScalesAs can be understood from the name of intelligence types according to their scales, it is the name given to the classification of intelligence fields according to their scales or levels. This classification is separated from intelligence completely according to the fields that divide intelligence into two, and it is divided into 3 in some sources and 4 in some sources. This distinction may vary according to each institution and the methods they use, even according to the subjects and services in which they conduct intelligence work. Today, I will cover these 4 basic principles and tell you how important they are in the military sense.Strategic IntelligenceAs the meaning of the word strategic intelligence includes, it enables the managers of states or institutions, who have the most authority and authority to make decisions, to produce realistic strategies and plans by strategically identifying threats and opportunities and evaluating them, as well as to gather the necessary information in the implementation process and make greater inferences. intelligence field.On the basis of institutions or states, this intelligence field has a great place in the implementation of long-term plans and policies against counter-threats. While this intelligence field on the basis of countries helps to make a more accurate decision process and more accurate decision, on the basis of institutions, this intelligence field helps in the planning of future intelligence operations and ensures stability, and helps the intelligence wheel to function more regularly.Tactical IntelligenceTactical intelligence is an intelligence field that has a very complex structure but is easy to explain. This intelligence field is the intelligence field used to determine the current status, potential, power, and purpose of the friend or foe during operations and wars. The information obtained thanks to this intelligence field is immediately evaluated and directed to the institution or department that needs information.Operational IntelligenceOperational Intelligence is the intelligence field formed from the whole of tactical intelligence operations working in an integrated manner for a specific purpose or purposes. For states, operational intelligence is used in times of war to obtain information about the status of the front and developments in times of war. In peacetime, this type of intelligence includes military operational exercises and reconnaissance flights. And our last title, Integrated Intelligence.Integrated IntelligenceIntegrated intelligence is not a field. We express the order, but in terms of a term; It refers to the efforts of institutions carrying out tactical, operational and strategic intelligence operations to work together and coordinately when needed, to provide continuous information flow and to obtain this information.And so we have put the end of our basic intelligence series.From now on, we will continue with our new series, cyber intelligence. Hope to see you in my new series, building from the ground up and covering all the information an intelligence analyst needs to know.",
            "content_html": "<p><img src=\"/images/olceklerine.png\" /></p><blockquote>  <p>Hello everyone! I am here with the last article of the basic intelligence series, intelligence types according to their scales. Good reading.</p></blockquote><h3 id=\"summary\">Summary</h3><p>In the previous article, the intelligence series according to their fields, we have elaborated and exemplified the subjects and branches of intelligence according to their fields. Today, I will show you the classification of intelligence types according to their scales and how this classification can create differences on a user basis. So, without further ado, let’s get to the point.</p><h3 id=\"intelligence-by-scales\">Intelligence by Scales</h3><p>As can be understood from the name of intelligence types according to their scales, it is the name given to the classification of intelligence fields according to their scales or levels. This classification is separated from intelligence completely according to the fields that divide intelligence into two, and it is divided into 3 in some sources and 4 in some sources. This distinction may vary according to each institution and the methods they use, even according to the subjects and services in which they conduct intelligence work. Today, I will cover these 4 basic principles and tell you how important they are in the military sense.</p><h4 id=\"strategic-intelligence\">Strategic Intelligence</h4><p>As the meaning of the word strategic intelligence includes, it enables the managers of states or institutions, who have the most authority and authority to make decisions, to produce realistic strategies and plans by strategically identifying threats and opportunities and evaluating them, as well as to gather the necessary information in the implementation process and make greater inferences. intelligence field.</p><p>On the basis of institutions or states, this intelligence field has a great place in the implementation of long-term plans and policies against counter-threats. While this intelligence field on the basis of countries helps to make a more accurate decision process and more accurate decision, on the basis of institutions, this intelligence field helps in the planning of future intelligence operations and ensures stability, and helps the intelligence wheel to function more regularly.</p><h4 id=\"tactical-intelligence\">Tactical Intelligence</h4><p>Tactical intelligence is an intelligence field that has a very complex structure but is easy to explain. This intelligence field is the intelligence field used to determine the current status, potential, power, and purpose of the friend or foe during operations and wars. The information obtained thanks to this intelligence field is immediately evaluated and directed to the institution or department that needs information.</p><h4 id=\"operational-intelligence\">Operational Intelligence</h4><p>Operational Intelligence is the intelligence field formed from the whole of tactical intelligence operations working in an integrated manner for a specific purpose or purposes. For states, operational intelligence is used in times of war to obtain information about the status of the front and developments in times of war. In peacetime, this type of intelligence includes military operational exercises and reconnaissance flights. And our last title, Integrated Intelligence.</p><h4 id=\"integrated-intelligence\">Integrated Intelligence</h4><p>Integrated intelligence is not a field. We express the order, but in terms of a term; It refers to the efforts of institutions carrying out tactical, operational and strategic intelligence operations to work together and coordinately when needed, to provide continuous information flow and to obtain this information.</p><p>And so we have put the end of our basic intelligence series.From now on, we will continue with our new series, cyber intelligence. Hope to see you in my new series, building from the ground up and covering all the information an intelligence analyst needs to know.</p>",
            "url": "http://localhost:4000/types-of-intelligence-by-scale/",
            
            
            
            
            
            "date_published": "2023-01-29T00:00:00+03:00",
            "date_modified": "2023-01-29T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/types-of-intelligence-by-fields/",
            "title": "Types of Intelligence by Fields",
            "summary": null,
            "content_text": "  Hello again! I am with you with the 4th article of the Basic Intelligence series. In my previous article, Fundamental Principles of Intelligence, with you in my article, confidentiality, speed, accuracy, etc. We covered the principles of intelligence. Today, I have prepared a nice blog post on Intelligence by Field. Without further ado, let’s get to the topic. Have a good read so far.Intelligence by FieldsIntelligence according to their fields, as can be understood from the title; refers to the classification of intelligence types according to their fields. Although it doesn’t make sense by definition, the types of intelligence it contains are vitally important.Political IntelligencePolitical intelligence is the first type of intelligence that comes to mind when the word intelligence is used. In addition, this type of intelligence includes some of the military intelligence and constitutes the most comprehensive issues in intelligence. So let’s examine political intelligence.As I have just mentioned, political intelligence includes the most comprehensive subjects of intelligence, but it would be best to examine this type of intelligence in 2 subjects. What are these 2 titles?  Foreign Political Intelligence  Domestic Political IntelligenceIt is shaped by two main headings, namely, political intelligence. Well, if we need to examine the concept of foreign political intelligence a little bit.Foreign Political Intelligence; This intelligence title is an incorruptible structure that has been taken against all other states with which the country has or has not established close relations for its own security, against any recognized or unrecognized state, with or without borders. can be summarized as attitude and attitude. Foreign policy and diplomacy have unbreakable integrity in terms of international relations. It is impossible to break this unity or try to distinguish it from each other. This integrity includes the diplomacy line applied by states against other states today. Therefore, it is completely connected with Foreign Political Intelligence.Domestic Political Intelligence; This intelligence title means that regardless of the management style of the countries, the administrators or administrators, who are the responsible decision-making bodies of the state, are prepared by the authorized intelligence agency or by the administrators against possible threats, taking into account the friendly and enemy factors while managing their countries. It is intelligence made primarily by reasoning. It is not possible to go into detail in this intelligence title. The reason is to give an example because it is deciphered against the management structure, it includes legal responsibilities. That’s why I didn’t want to touch on such an example of domestic political intelligence.So let’s move on to our next title, Military Intelligence.Military IntelligenceSince the first known written sources, the subject that has attracted the most attention of researchers has been the importance given to military intelligence in the inscriptions. Throughout the history of humanity, wars and peace have always witnessed the most important turning points in our civilization history. According to Ümit Özdağ on this subject, 87% of the history of civilization was spent with wars and the remaining 13% with preparations for wars. We are witnessing this today. Whenever there are some political crises between the states, there is no limit to the intelligence operations going around. So a little technical explanation is needed. Military Intelligence; One of the most important duties of the states against the societies living in their own lands is to keep the land they hold away from all kinds of internal and external threats, to take measures to ensure its continuity and loyalty, and in this sense to use its armed strength from any angle. is to not hesitate to use it for the permanence of the state and to strive for the permanence of the state.Military power is the greatest power that states can have against other states in the past and today. But it is necessary to crown it with Intelligence. Gathering information about geographically neighboring states, even in times of peace, laid the groundwork for the most rooted intelligence field in human history. For this reason, Military Intelligence and Political Intelligence are the subjects that have the longest history in this branch of science and should be explained in detail without any misunderstanding.Economic IntelligenceEconomic Intelligence is the determination and examination of the possibilities and resources of states, terrorist organizations, and organizations in order to determine whether states can achieve their goals against internal or external threats. While conducting economic intelligence studies, for example, studies are carried out under these headings at the stage of gathering information against the target.  Target’s Financial Structure and Policy,  Economic Status of the Target,  Monetary Policy of the Target,  Agriculture Sector,  The industry sector,  Trade Sector and Policies  Raw Material Resources,  Size of Import and Export,  Stocks and Domestic Production Resources,  etc.Such titles can be given as examples in this regard. If we think of the titles as a tree, it has hundreds of sub-branches. Economic intelligence studies can vary by institution. The important thing here is to process the data impartially. Otherwise, such a study may fail at some points.In addition, there is one more point that I would like to mention in this regard. The Economy of the target is in Who or Whom hands. The counter threat is directed towards other countries on which it is economically dependent for various reasons, e.g. raw materials, food, industry, technology, etc. Its commitment in areas such as When we look at the history of humanity, the most powerful empires or states developed around the Silk Road route, which was the trade center or source of the time. Therefore, a strong country must have a strong economy. A country with a strong economy will also have advanced intelligence requirements. There can be many comments on the subject, but let’s cut it off here and continue with our other topic, Social Intelligence.Social IntelligenceSocial Intelligence is an intelligence field that is fully integrated with sociology. So what is sociology? Sociology means society. It examines the social behaviors, movements, religions, views, worldviews, and ideologies of people and therefore societies. Intelligence also benefits from this. Intelligence conducts its studies on societies in times of peace and war, using sociology. It examines the fragile points, sacred and important spiritual values of the people and makes inferences.Every country has a different social and cultural structure. Social intelligence includes the analysis of the social structure and the data collection and analysis process necessary for a more successful process of intelligence activities against the target society or societies.Geographical IntelligenceGeographical Intelligence, the geography of countries has indispensable importance in terms of intelligence. Until the 19th century, knowing the mountains, seas, wetlands, and rivers and learning information such as climate was more important than learning the capacities and powers of the armies in those years, without even having to look at our distant past. On behalf of intelligence agencies and military units, mapping and learning tomographic information of countries and using them in intelligence operations still have a very important place today.However, nowadays, with the development of technology, these data are not only accessible to intelligence agencies or military structures. Anyone who wishes can access this information and analyze it. However, individuals or studies without sufficient data always have limited information, but intelligence agencies are obliged to have the most up-to-date and accurate information, and intensive studies are carried out for this. The most effective mapping and imaging studies in this area are spy satellites and observation tools.Communications and Transport IntelligenceCommunications and Transportation Intelligence; Information about how these regions are managed in times of crisis, radio, television, telephone, highway, airway, sea transportation, trade points, stations, ports, and the characteristics of all these regions. covers.It is necessary for countries to collect and report information against each other in times of peace, and to use this information in appropriate conditions and times during times of war. At the point where technology has reached today, individual people can reach this information, which was very important and valuable in the past, with most mapping and navigation systems. However, as I mentioned before, intelligence services have to access the most up-to-date information.Biographical IntelligenceBiographical Intelligence is an intelligence field that is applied from the smallest unit affiliated with the state to the most authorized person. This intelligence field includes the private and public information collected about the economic, political, cultural, material, and moral values ​​of the country, as well as the individuals who live in the military and potentially important people as well as individuals with secret connections.Technical IntelligenceTechnical Intelligence is the acquisition of intelligence using various methods. By definition, its explanation is long and requires detail, because technical intelligence is not applied in a specific way. We need to touch on the various methods and examine their workings. But if we consider it as a technical definition…Technical Intelligence; Collecting information about targets using necessary technology and methods. In order for this intelligence field to function, both technologically technical equipment and personnel to use this equipment are needed.Technical intelligence is often categorized separately from scientific intelligence, but since they are close and related topics, I will prefer to treat them together. So What Is Scientific Intelligence?Scientific Intelligence; As can be understood from the name of this intelligence field, it is possible to follow up in the field of science, technology, and weapons owned by rival states, and with the information leak operations to be carried out while this process is running, with the weapons made with minimum resource expenditure based on the research of other states. is to continue the arms, industry, and technology race against other states.Cyber IntelligenceConsidering the point where technology and science have come today, Cyber ​​Intelligence, IoTs, Online Services, Data Centers, etc. There have been attacks targeting this data in cyberspace where big data is and is constantly processed. In order to keep up with today’s technologies in order to develop a defense against these attacks, a new intelligence field, cyber intelligence, has emerged. Developed and developing countries invest heavily in this area. In addition, when we look at all other fields, the field of cyber intelligence has been the most invested and rapidly growing intelligence field with the effective and correct use of technology. This development is developing rapidly in all countries where the internet and technology are used and used effectively.Later on cyber intelligence, methods, techniques, cyber world, cyber wars, etc. I will publish my blogs with a learning process like the operation of the basic intelligence series by taking the topics as the title.We have come to the end of my blog post for today. Since there are very few resources in this field, I can write my blogs with limited access. However, I will deal with all these topics with examples and details in the future. For now, I hope to see you in my next article, Types of Intelligence by Scale. Stay tuned.Click here to read the fifth part of the series, Intelligence Types by Scale.  Types of Intelligence by Scale • July 18, 2022",
            "content_html": "<p><img src=\"/images/alanlarina.png\" /></p><blockquote>  <p>Hello again! I am with you with the 4th article of the Basic Intelligence series. In my previous article, Fundamental Principles of Intelligence, with you in my article, confidentiality, speed, accuracy, etc. We covered the principles of intelligence. Today, I have prepared a nice blog post on Intelligence by Field. Without further ado, let’s get to the topic. Have a good read so far.</p></blockquote><h3 id=\"intelligence-by-fields\">Intelligence by Fields</h3><p>Intelligence according to their fields, as can be understood from the title; refers to the classification of intelligence types according to their fields. Although it doesn’t make sense by definition, the types of intelligence it contains are vitally important.</p><h4 id=\"political-intelligence\">Political Intelligence</h4><p>Political intelligence is the first type of intelligence that comes to mind when the word intelligence is used. In addition, this type of intelligence includes some of the military intelligence and constitutes the most comprehensive issues in intelligence. So let’s examine political intelligence.</p><p>As I have just mentioned, political intelligence includes the most comprehensive subjects of intelligence, but it would be best to examine this type of intelligence in 2 subjects. What are these 2 titles?<br /><br /></p><ul>  <li><strong>Foreign Political Intelligence</strong></li>  <li><strong>Domestic Political Intelligence</strong></li></ul><p><br /><br />It is shaped by two main headings, namely, political intelligence. Well, if we need to examine the concept of foreign political intelligence a little bit.</p><p><b>Foreign Political Intelligence;</b> This intelligence title is an incorruptible structure that has been taken against all other states with which the country has or has not established close relations for its own security, against any recognized or unrecognized state, with or without borders. can be summarized as attitude and attitude. Foreign policy and diplomacy have unbreakable integrity in terms of international relations. It is impossible to break this unity or try to distinguish it from each other. This integrity includes the diplomacy line applied by states against other states today. Therefore, it is completely connected with Foreign Political Intelligence.</p><p><b>Domestic Political Intelligence;</b> This intelligence title means that regardless of the management style of the countries, the administrators or administrators, who are the responsible decision-making bodies of the state, are prepared by the authorized intelligence agency or by the administrators against possible threats, taking into account the friendly and enemy factors while managing their countries. It is intelligence made primarily by reasoning. It is not possible to go into detail in this intelligence title. The reason is to give an example because it is deciphered against the management structure, it includes legal responsibilities. That’s why I didn’t want to touch on such an example of domestic political intelligence.</p><p>So let’s move on to our next title, Military Intelligence.</p><p><br /></p><h4 id=\"military-intelligence\">Military Intelligence</h4><p>Since the first known written sources, the subject that has attracted the most attention of researchers has been the importance given to military intelligence in the inscriptions. Throughout the history of humanity, wars and peace have always witnessed the most important turning points in our civilization history. According to Ümit Özdağ on this subject, 87% of the history of civilization was spent with wars and the remaining 13% with preparations for wars. We are witnessing this today. Whenever there are some political crises between the states, there is no limit to the intelligence operations going around. So a little technical explanation is needed. <br /><br /><strong>Military Intelligence;</strong> One of the most important duties of the states against the societies living in their own lands is to keep the land they hold away from all kinds of internal and external threats, to take measures to ensure its continuity and loyalty, and in this sense to use its armed strength from any angle. is to not hesitate to use it for the permanence of the state and to strive for the permanence of the state.</p><p>Military power is the greatest power that states can have against other states in the past and today. But it is necessary to crown it with Intelligence. Gathering information about geographically neighboring states, even in times of peace, laid the groundwork for the most rooted intelligence field in human history. For this reason, Military Intelligence and Political Intelligence are the subjects that have the longest history in this branch of science and should be explained in detail without any misunderstanding.</p><p><br /></p><h4 id=\"economic-intelligence\">Economic Intelligence</h4><p>Economic Intelligence is the determination and examination of the possibilities and resources of states, terrorist organizations, and organizations in order to determine whether states can achieve their goals against internal or external threats. While conducting economic intelligence studies, for example, studies are carried out under these headings at the stage of gathering information against the target.<br /><br /></p><ul>  <li>Target’s Financial Structure and Policy,</li>  <li>Economic Status of the Target,</li>  <li>Monetary Policy of the Target,</li>  <li>Agriculture Sector,</li>  <li>The industry sector,</li>  <li>Trade Sector and Policies</li>  <li>Raw Material Resources,</li>  <li>Size of Import and Export,</li>  <li>Stocks and Domestic Production Resources,</li>  <li>etc.<br /><br /></li></ul><p>Such titles can be given as examples in this regard. If we think of the titles as a tree, it has hundreds of sub-branches. Economic intelligence studies can vary by institution. The important thing here is to process the data impartially. Otherwise, such a study may fail at some points.</p><p>In addition, there is one more point that I would like to mention in this regard. The <strong>Economy of the target is in Who or Whom</strong> hands. The counter threat is directed towards other countries on which it is economically dependent for various reasons, e.g. raw materials, food, industry, technology, etc. Its commitment in areas such as When we look at the history of humanity, the most powerful empires or states developed around the Silk Road route, which was the trade center or source of the time. Therefore, a strong country must have a strong economy. A country with a strong economy will also have advanced intelligence requirements. There can be many comments on the subject, but let’s cut it off here and continue with our other topic, Social Intelligence.</p><p><br /></p><h4 id=\"social-intelligence\">Social Intelligence</h4><p>Social Intelligence is an intelligence field that is fully integrated with sociology. So what is sociology? Sociology means society. It examines the social behaviors, movements, religions, views, worldviews, and ideologies of people and therefore societies. Intelligence also benefits from this. Intelligence conducts its studies on societies in times of peace and war, using sociology. It examines the fragile points, sacred and important spiritual values of the people and makes inferences.</p><p>Every country has a different social and cultural structure. Social intelligence includes the analysis of the social structure and the data collection and analysis process necessary for a more successful process of intelligence activities against the target society or societies.</p><p><br /></p><h4 id=\"geographical-intelligence\">Geographical Intelligence</h4><p>Geographical Intelligence, the geography of countries has indispensable importance in terms of intelligence. Until the 19th century, knowing the mountains, seas, wetlands, and rivers and learning information such as climate was more important than learning the capacities and powers of the armies in those years, without even having to look at our distant past. On behalf of intelligence agencies and military units, mapping and learning tomographic information of countries and using them in intelligence operations still have a very important place today.</p><p>However, nowadays, with the development of technology, these data are not only accessible to intelligence agencies or military structures. Anyone who wishes can access this information and analyze it. However, individuals or studies without sufficient data always have limited information, but intelligence agencies are obliged to have the most up-to-date and accurate information, and intensive studies are carried out for this. The most effective mapping and imaging studies in this area are spy satellites and observation tools.</p><p><br /></p><h4 id=\"communications-and-transport-intelligence\">Communications and Transport Intelligence</h4><p>Communications and Transportation Intelligence; Information about how these regions are managed in times of crisis, radio, television, telephone, highway, airway, sea transportation, trade points, stations, ports, and the characteristics of all these regions. covers.</p><p>It is necessary for countries to collect and report information against each other in times of peace, and to use this information in appropriate conditions and times during times of war. At the point where technology has reached today, individual people can reach this information, which was very important and valuable in the past, with most mapping and navigation systems. However, as I mentioned before, intelligence services have to access the most up-to-date information.</p><p><br /></p><h4 id=\"biographical-intelligence\">Biographical Intelligence</h4><p>Biographical Intelligence is an intelligence field that is applied from the smallest unit affiliated with the state to the most authorized person. This intelligence field includes the private and public information collected about the economic, political, cultural, material, and moral values ​​of the country, as well as the individuals who live in the military and potentially important people as well as individuals with secret connections.</p><p><br /></p><h4 id=\"technical-intelligence\">Technical Intelligence</h4><p>Technical Intelligence is the acquisition of intelligence using various methods. By definition, its explanation is long and requires detail, because technical intelligence is not applied in a specific way. We need to touch on the various methods and examine their workings. But if we consider it as a technical definition…</p><p><strong>Technical Intelligence;</strong> Collecting information about targets using necessary technology and methods. In order for this intelligence field to function, both technologically technical equipment and personnel to use this equipment are needed.</p><p>Technical intelligence is often categorized separately from scientific intelligence, but since they are close and related topics, I will prefer to treat them together. So What Is Scientific Intelligence?</p><p><strong>Scientific Intelligence;</strong> As can be understood from the name of this intelligence field, it is possible to follow up in the field of science, technology, and weapons owned by rival states, and with the information leak operations to be carried out while this process is running, with the weapons made with minimum resource expenditure based on the research of other states. is to continue the arms, industry, and technology race against other states.</p><p><br /></p><h4 id=\"cyber-intelligence\">Cyber Intelligence</h4><p>Considering the point where technology and science have come today, Cyber ​​Intelligence, IoTs, Online Services, Data Centers, etc. There have been attacks targeting this data in cyberspace where big data is and is constantly processed. In order to keep up with today’s technologies in order to develop a defense against these attacks, a new intelligence field, cyber intelligence, has emerged. Developed and developing countries invest heavily in this area. In addition, when we look at all other fields, the field of cyber intelligence has been the most invested and rapidly growing intelligence field with the effective and correct use of technology. This development is developing rapidly in all countries where the internet and technology are used and used effectively.</p><p>Later on cyber intelligence, methods, techniques, cyber world, cyber wars, etc. I will publish my blogs with a learning process like the operation of the basic intelligence series by taking the topics as the title.</p><p>We have come to the end of my blog post for today. Since there are very few resources in this field, I can write my blogs with limited access. However, I will deal with all these topics with examples and details in the future. For now, I hope to see you in my next article, Types of Intelligence by Scale. Stay tuned.</p><p>Click here to read the fifth part of the series, Intelligence Types by Scale.</p><blockquote>  <p><a href=\"/types-of-intelligence-by-scale/\">Types of Intelligence by Scale • July 18, 2022</a></p></blockquote>",
            "url": "http://localhost:4000/types-of-intelligence-by-fields/",
            
            
            
            "tags": ["intelligence","cycle","data","security","operations","roadmap"],
            
            "date_published": "2023-01-22T00:00:00+03:00",
            "date_modified": "2023-01-22T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/basic-principles-of-intelligence",
            "title": "Basic Principles of Intelligence",
            "summary": null,
            "content_text": "  This article provides information about the Fundamental Principles of Intelligence.In the first article of the Basic Intelligence series, I touched on basic issues such as Intelligence, the Importance of Intelligence, and the Intelligence Wheel. In this blog post, which is the 3rd article of the series, I will cover the principles of modern intelligence under the title of Basic Principles of Intelligence. I wish you good reading in advance.SummaryIntelligence Fundamentals, Confidentiality, Speed, Accuracy etc. includes principles such as These principles are the basic building blocks that work completely in parallel with the intelligence wheel. However, it would not be very accurate to describe them only as building blocks.Basic Principles of IntelligenceIn the globalizing and constantly developing world order, we see that the initiatives and formations are increasing day by day, in the intelligence activities of today, getting out of the hands of the states and passing into the hands of multinational companies and companies that carry out regional activities in the private sector. However, in the changing world, the only thing that has changed in the field of intelligence is the loss of the sector from the hands of the states, rather than resorting to private initiatives. Developing and modernizing intelligence techniques and principles. Such principles are the major factor that distinguishes modern intelligence from conventional intelligence. I will talk about the difference between modern intelligence and traditional intelligence later, but for now let’s take a look at the basic principles of intelligence, starting with modern intelligence that gave rise to these principles. • Principle of  Privacy: Confidentiality in Intelligence. The principle of confidentiality in intelligence defends the confidentiality of data from institutions, organizations, and employees to the most unauthorized personnel, regardless of what subject and task they are involved in the intelligence process. In response to the potential for information leaks wherever people are, such a policy provides the building blocks for how data is kept secure. • Principle of Speed: The speed principle in the intelligence process is a principle that should be applied at every stage of the intelligence wheel. This principle is of great importance in taking action against counterintelligence in the work of Countering Intelligence called IKK. It means that the process should run quickly. • Principle of Accuracy: The principle of accuracy refers to the accuracy of the source of the data in intelligence. There is a principle of accuracy to eliminate all kinds of shady environments, from referring to trusted sources and transmitting and reporting data correctly. • Principle of Certainty: Certainty in intelligence is a principle that has serious implications for public institutions rather than the private sector. To explain this in more detail. The certainty principle states that intelligence must be precise and clear. The principle of certainty advocates a clear stance and behavior in the face of an event. Therefore, intelligence information should be clear and precise. • Principle of Flexibility: Another important principle in the intelligence process is the flexibility principle. This principle states that intelligence should constantly evolve. In other words, he argues that the intelligence structure in the developing and globalizing world has to adapt to developments. • Principle of Impartiality: The principle of neutrality in intelligence is a principle that can be considered indispensable for a successful intelligence process. This principle states that in the intelligence process, data should be collected objectively by creating an analytical mindset at the stage of intelligence collection. These principles form the foundations of modern intelligence and paved the way for the intelligence process to abandon the old methods and move from the traditional intelligence process to the modern intelligence process. However, after processing the basic principles of intelligence, we should divide it into two areas and scales. The main reason for this is that modern intelligence has to determine the target in the first place in order to reach the right conclusion.Although I will end the Basic Intelligence Principles with this article, we will be together again in my next article, Intelligence Types by Fields and Scales.Click here to read the fourth part of the article, Intelligence Types by Fields and Scales.  Types of Intelligence by Fields • August 1, 2022",
            "content_html": "<p><img src=\"/images/bpoi-main.png\" /></p><blockquote>  <p>This article provides information about the Fundamental Principles of Intelligence.</p></blockquote><p>In the first article of the Basic Intelligence series, I touched on basic issues such as Intelligence, the Importance of Intelligence, and the Intelligence Wheel. In this blog post, which is the 3rd article of the series, I will cover the principles of modern intelligence under the title of Basic Principles of Intelligence. I wish you good reading in advance.</p><h3 id=\"summary\">Summary</h3><p>Intelligence Fundamentals, Confidentiality, Speed, Accuracy etc. includes principles such as These principles are the basic building blocks that work completely in parallel with the intelligence wheel. However, it would not be very accurate to describe them only as building blocks.</p><h3 id=\"basic-principles-of-intelligence\">Basic Principles of Intelligence</h3><p>In the globalizing and constantly developing world order, we see that the initiatives and formations are increasing day by day, in the intelligence activities of today, getting out of the hands of the states and passing into the hands of multinational companies and companies that carry out regional activities in the private sector. However, in the changing world, the only thing that has changed in the field of intelligence is the loss of the sector from the hands of the states, rather than resorting to private initiatives. Developing and modernizing intelligence techniques and principles. Such principles are the major factor that distinguishes modern intelligence from conventional intelligence. I will talk about the difference between modern intelligence and traditional intelligence later, but for now let’s take a look at the basic principles of intelligence, starting with modern intelligence that gave rise to these principles.<br /></p><p><b> • Principle of  Privacy: </b>Confidentiality in Intelligence. The principle of confidentiality in intelligence defends the confidentiality of data from institutions, organizations, and employees to the most unauthorized personnel, regardless of what subject and task they are involved in the intelligence process. In response to the potential for information leaks wherever people are, such a policy provides the building blocks for how data is kept secure.<br /></p><p><b> • Principle of Speed: </b>The speed principle in the intelligence process is a principle that should be applied at every stage of the intelligence wheel. This principle is of great importance in taking action against counterintelligence in the work of Countering Intelligence called IKK. It means that the process should run quickly.<br /></p><p><b> • Principle of Accuracy: </b>The principle of accuracy refers to the accuracy of the source of the data in intelligence. There is a principle of accuracy to eliminate all kinds of shady environments, from referring to trusted sources and transmitting and reporting data correctly.<br /></p><p><b> • Principle of Certainty: </b>Certainty in intelligence is a principle that has serious implications for public institutions rather than the private sector. To explain this in more detail. The certainty principle states that intelligence must be precise and clear. The principle of certainty advocates a clear stance and behavior in the face of an event. Therefore, intelligence information should be clear and precise.<br /></p><p><b> • Principle of Flexibility: </b>Another important principle in the intelligence process is the flexibility principle. This principle states that intelligence should constantly evolve. In other words, he argues that the intelligence structure in the developing and globalizing world has to adapt to developments.<br /></p><p><b> • Principle of Impartiality: </b>The principle of neutrality in intelligence is a principle that can be considered indispensable for a successful intelligence process. This principle states that in the intelligence process, data should be collected objectively by creating an analytical mindset at the stage of intelligence collection. <br /></p><p>These principles form the foundations of modern intelligence and paved the way for the intelligence process to abandon the old methods and move from the traditional intelligence process to the modern intelligence process. However, after processing the basic principles of intelligence, we should divide it into two areas and scales. The main reason for this is that modern intelligence has to determine the target in the first place in order to reach the right conclusion.</p><p>Although I will end the Basic Intelligence Principles with this article, we will be together again in my next article, Intelligence Types by Fields and Scales.</p><p>Click here to read the fourth part of the article, Intelligence Types by Fields and Scales.</p><blockquote>  <p><a href=\"/types-of-intelligence-by-fields/\">Types of Intelligence by Fields • August 1, 2022</a></p></blockquote>",
            "url": "http://localhost:4000/basic-principles-of-intelligence",
            
            
            
            "tags": ["intelligence","cycle","data","security","operations","roadmap"],
            
            "date_published": "2023-01-15T00:00:00+03:00",
            "date_modified": "2023-01-15T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/intelligence-cycle",
            "title": "Intelligence Cycle",
            "summary": "In this article, the four basic items in the Intelligence Cycle and their in-depth explanations are given.",
            "content_text": "\t  In this article, the four basic items in the Intelligence Cycle and their in-depth explanations are given.What is the Intelligence Cycle?What is the Intelligence Cycle? As can be seen in the example I added above, the intelligence cycle means the regular and systematic processing of the data obtained through intelligence. This cycle has an endless loop and an operation that constantly renews itself. In addition, intelligence activities are studies that continue uninterrupted. For this reason, many different institutions, basically similar to this methodology, have many different methods of processing intelligence data. However, it is necessary to examine them in 4 main branches: • Intelligence Needs Assessment:  Identification of Intelligence Needs, which is the first phase of intelligence, has an important place in the initiation and continuity of the intelligence cycle. In this part, it is aimed to get more results from the institution that will obtain the intelligence, by giving the main information required by the institution or organization that will provide the intelligence to the institution that will obtain the intelligence. Thus, the cycle begins and the intelligence agency bears the responsibility until the last stage. • Intelligence Gathering:  In the second phase of intelligence, the institution or organization requesting the intelligence is completely removed from the intelligence cycle and all the work is left to the intelligence agency. At this stage of the cycle, the “data collection” part, which is the basic building block of the intelligence process, takes charge. At this stage, while the data collection process continues with the institution’s own methods, the data obtained are divided into two open and closed. Since resources such as newspapers, books, magazines, radio, and television are accessible to everyone, they are called Open Sources in this section. In other words, it is a different expression of the Open-Source word that creates OSINT.In addition to open and accessible sources, the data obtained by intelligence agencies by applying different methods and methods during the “data collection” stage are also referred to as closed intelligence data. Well, let’s take a look at what needs to be done after collecting the data. • Processing of Intelligence Data:  The third phase of intelligence includes the processing and evaluation of data collected in the previous phase. When collecting intelligence data, we divided it into two parts. This filtering method allowed us to divide the data into two different categories, Open and Closed. The next method for categorizing data is the appraisal and classification part. In this section, the accuracy of the data is first questioned. The data verified by various sources belonging to the institutions are evaluated as to what kind and to what extent it can be used upon incoming demand. To explain in detail. Classification is the first part of this phase. In the evaluation of the data, similar data are brought together thanks to the classification process. Another step is to evaluate the data, in other words, to evaluate it. In the valuation phase, similar data are graded by various methods according to the accuracy and trust of the source. In the last stage, the obtained data is interpreted. As I said at the beginning of my article. Intelligence drives reasoning and achieves results. And so the final phase is passed. • Using Intelligence Data: In the fourth and final phase of intelligence, there is the use and publication of data that we have evaluated and interpreted in the previous phase. If we take a scenario-based example, after the data obtained as a result of such a cycle is interpreted, based on the necessary analysis and methods, it is transmitted to the institution requesting the intelligence data. Although we seem to have reached the end of such a cycle, we are returning to the first step in the opposite way. That’s why the intelligence cycle is endless. It has a structure that constantly renews itself.Click to read the third part of the article, Basic Principles of Intelligence.  Basic Principles of Intelligence • July 11, 2022",
            "content_html": "<p align=\"center\">\t<img src=\"/images/intelligence_cycle.png\" height=\"350\" width=\"700\" /></p><blockquote>  <p>In this article, the four basic items in the Intelligence Cycle and their in-depth explanations are given.</p></blockquote><h3 id=\"what-is-the-intelligence-cycle\">What is the Intelligence Cycle?<br /></h3><p>What is the Intelligence Cycle? As can be seen in the example I added above, the intelligence cycle means the regular and systematic processing of the data obtained through intelligence. This cycle has an endless loop and an operation that constantly renews itself. In addition, intelligence activities are studies that continue uninterrupted. For this reason, many different institutions, basically similar to this methodology, have many different methods of processing intelligence data. However, it is necessary to examine them in 4 main branches:<br /></p><p><b> • Intelligence Needs Assessment: </b> Identification of Intelligence Needs, which is the first phase of intelligence, has an important place in the initiation and continuity of the intelligence cycle. In this part, it is aimed to get more results from the institution that will obtain the intelligence, by giving the main information required by the institution or organization that will provide the intelligence to the institution that will obtain the intelligence. Thus, the cycle begins and the intelligence agency bears the responsibility until the last stage.<br /></p><p><b> • Intelligence Gathering: </b> In the second phase of intelligence, the institution or organization requesting the intelligence is completely removed from the intelligence cycle and all the work is left to the intelligence agency. At this stage of the cycle, the “data collection” part, which is the basic building block of the intelligence process, takes charge. At this stage, while the data collection process continues with the institution’s own methods, the data obtained are divided into two open and closed. Since resources such as newspapers, books, magazines, radio, and television are accessible to everyone, they are called Open Sources in this section. In other words, it is a different expression of the Open-Source word that creates OSINT.<br /><br />In addition to open and accessible sources, the data obtained by intelligence agencies by applying different methods and methods during the “data collection” stage are also referred to as closed intelligence data. Well, let’s take a look at what needs to be done after collecting the data.<br /></p><p><b> • Processing of Intelligence Data: </b> The third phase of intelligence includes the processing and evaluation of data collected in the previous phase. When collecting intelligence data, we divided it into two parts. This filtering method allowed us to divide the data into two different categories, Open and Closed. The next method for categorizing data is the appraisal and classification part. In this section, the accuracy of the data is first questioned. The data verified by various sources belonging to the institutions are evaluated as to what kind and to what extent it can be used upon incoming demand. To explain in detail. Classification is the first part of this phase. In the evaluation of the data, similar data are brought together thanks to the classification process. Another step is to evaluate the data, in other words, to evaluate it. In the valuation phase, similar data are graded by various methods according to the accuracy and trust of the source. In the last stage, the obtained data is interpreted. As I said at the beginning of my article. Intelligence drives reasoning and achieves results. And so the final phase is passed.</p><p><b> • Using Intelligence Data: </b>In the fourth and final phase of intelligence, there is the use and publication of data that we have evaluated and interpreted in the previous phase. If we take a scenario-based example, after the data obtained as a result of such a cycle is interpreted, based on the necessary analysis and methods, it is transmitted to the institution requesting the intelligence data. Although we seem to have reached the end of such a cycle, we are returning to the first step in the opposite way. That’s why the intelligence cycle is endless. It has a structure that constantly renews itself.<br /></p><p>Click to read the third part of the article, Basic Principles of Intelligence.</p><blockquote>  <p><a href=\"/basic-principles-of-intelligence\">Basic Principles of Intelligence • July 11, 2022</a></p></blockquote>",
            "url": "http://localhost:4000/intelligence-cycle",
            "image": "images/istihbarat-og.png",
            
            
            "tags": ["intelligence","cycle","data","security","operations","roadmap"],
            
            "date_published": "2023-01-08T00:00:00+03:00",
            "date_modified": "2023-01-08T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/intelligence-and-the-importance-of-intelligence",
            "title": "Intelligence and Importance of Intelligence",
            "summary": "This article contains information about the Definition of Intelligence, the Origin of the Word, the Importance of Intelligence, How to Process Intelligence Data.",
            "content_text": "  This article contains information about the Definition of Intelligence, the Origin of the Word, the Importance of Intelligence, How to Process Intelligence Data.SummaryIntelligence refers to the ability to use the mind in the face of events in daily life, to adapt, and to implement it in the light of knowledge and experience.From the simplest to the most complex events, there is instant intelligence in every aspect of life. Intelligence is first and foremost about the use of reason and intelligence. The simplest and most basic; are reasoning, planning, abstract thinking, comprehension, learning, and learning from experience. All of this is an intelligence process. But intelligence is not just about them.What is Intelligence?In terms of the meaning of the word intelligence, it was translated into Turkish from Arabic. As the origin of the word, it has gained meaning in Turkish as the plural of the word “Istikhbar”, which expresses the present tense in Arabic. In terms of meaning, it means “news”, “new news”, “new information”. Technically speaking, “Intelligence is a product or information produced as a result of processing news (raw information).” Intelligence is to evaluate raw information and reach a conclusion with activities such as reasoning, planning, and data collection. Thus, the information obtained through intelligence activities is also used in intelligence activities. The information thus obtained is of great importance. How important is intelligence in this situation?Why Intelligence Matters?When we fully understand the meaning of intelligence, it is easier to understand why intelligence is important. Because intelligence means information. The importance of intelligence means to be able to see the future, to have prior knowledge of possible problems that may occur, and reach the real causes and sources of events and information, and intelligence is therefore important. News is raw information. In order to produce intelligence data, raw information must be systematically processed. Important intelligence, in other words, news, if not handled correctly, can lead to wrong results and plot. So how is intelligence data processed?How is Intelligence Data Processed?There are many methods of processing intelligence data. The raw information gathered about an event that has happened or will happen is processed through stages with interpretation and reasoning. Interpretation, that is, classification is the first stage of processing intelligence data. At this stage, similar information is brought together and interpreted among the raw information. Another topic of processing can be said as valuation, that is, valuation. In this process, it is the evaluation of the previously classified data. At this stage, factors such as the source, reliability, and accuracy of the data are evaluated and comments are made. Interpretation is the process of revealing the meaning and importance of the developments and similar situations based on the available intelligence data in order to reach a definite conclusion. Finally, it is the delivery of the intelligence data passed through these stages to the institutions and organizations that need it, when necessary and with appropriate reporting. And so the intelligence cycle is completed. Most intelligence agencies have given this order different names. There are names such as Intelligence cycle, Intelligence cycle, and Intelligence order. But they are all different nomenclature of the same methodology. Although this cycle often consists of 4 basic steps, it can be divided into different categories and classes as long as more filtering is required. So, let’s get rid of the basics and take a short trip in terms of intelligence. So, what is this intelligence cycle?Click to read the second part of the article, the Intelligence Cycle.  Intelligence Cycle • July 4, 2022",
            "content_html": "<p><img src=\"/images/intelligence-main.png\" /></p><blockquote>  <p>This article contains information about the Definition of Intelligence, the Origin of the Word, the Importance of Intelligence, How to Process Intelligence Data.</p></blockquote><h3 id=\"summary\">Summary</h3><p>Intelligence refers to the ability to use the mind in the face of events in daily life, to adapt, and to implement it in the light of knowledge and experience.From the simplest to the most complex events, there is instant intelligence in every aspect of life. Intelligence is first and foremost about the use of reason and intelligence. The simplest and most basic; are reasoning, planning, abstract thinking, comprehension, learning, and learning from experience. All of this is an intelligence process. But intelligence is not just about them.</p><h3 id=\"what-is-intelligence\">What is Intelligence?<br /></h3><p>In terms of the meaning of the word intelligence, it was translated into Turkish from Arabic. As the origin of the word, it has gained meaning in Turkish as the plural of the word “Istikhbar”, which expresses the present tense in Arabic. In terms of meaning, it means “news”, “new news”, “new information”. Technically speaking, “Intelligence is a product or information produced as a result of processing news (raw information).” Intelligence is to evaluate raw information and reach a conclusion with activities such as reasoning, planning, and data collection. Thus, the information obtained through intelligence activities is also used in intelligence activities. The information thus obtained is of great importance. How important is intelligence in this situation?<br /><br /></p><h3 id=\"why-intelligence-matters\">Why Intelligence Matters?<br /></h3><p>When we fully understand the meaning of intelligence, it is easier to understand why intelligence is important. Because intelligence means information. The importance of intelligence means to be able to see the future, to have prior knowledge of possible problems that may occur, and reach the real causes and sources of events and information, and intelligence is therefore important. News is raw information. In order to produce intelligence data, raw information must be systematically processed. Important intelligence, in other words, news, if not handled correctly, can lead to wrong results and plot. So how is intelligence data processed?<br /><br /></p><h3 id=\"how-is-intelligence-data-processed\">How is Intelligence Data Processed?<br /></h3><p>There are many methods of processing intelligence data. The raw information gathered about an event that has happened or will happen is processed through stages with interpretation and reasoning. Interpretation, that is, classification is the first stage of processing intelligence data. At this stage, similar information is brought together and interpreted among the raw information. Another topic of processing can be said as valuation, that is, valuation. In this process, it is the evaluation of the previously classified data. At this stage, factors such as the source, reliability, and accuracy of the data are evaluated and comments are made. Interpretation is the process of revealing the meaning and importance of the developments and similar situations based on the available intelligence data in order to reach a definite conclusion. Finally, it is the delivery of the intelligence data passed through these stages to the institutions and organizations that need it, when necessary and with appropriate reporting. And so the intelligence cycle is completed. Most intelligence agencies have given this order different names. There are names such as Intelligence cycle, Intelligence cycle, and Intelligence order. But they are all different nomenclature of the same methodology. Although this cycle often consists of 4 basic steps, it can be divided into different categories and classes as long as more filtering is required. <br /></p><p>So, let’s get rid of the basics and take a short trip in terms of intelligence. So, what is this intelligence cycle?<br /></p><p>Click to read the second part of the article, the Intelligence Cycle.</p><blockquote>  <p><a href=\"/intelligence-cycle\">Intelligence Cycle • July 4, 2022</a></p></blockquote>",
            "url": "http://localhost:4000/intelligence-and-the-importance-of-intelligence",
            "image": "/images/intelligence-og.png",
            
            
            "tags": ["intelligence","cycle","data","security","operations","roadmap"],
            
            "date_published": "2023-01-01T00:00:00+03:00",
            "date_modified": "2023-01-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/",
            "title": "➔ Network 101:",
            "summary": null,
            "content_text": "",
            "content_html": "",
            "url": "http://localhost:4000/",
            
            
            
            
            
            "date_published": "2022-05-01T00:00:00+03:00",
            "date_modified": "2022-05-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/ethernet-csma-cd-and-mac-address",
            "title": "Ethernet, CSMA/CD and MAC Address",
            "summary": null,
            "content_text": "  Hello everyone with a new blog post! I am here with the 4th blog post of the network basics series. Have a good read in advance.SummaryIn this blog post, we will continue with the TCP, UDP Protocols and TCP/IP Model that we have already covered, and we will move on to the basic concept of Ethernet. Let’s make a quick start to this article, starting with the history of Ethernet and extending to the MAC address.Ethernet and the History of EthernetEthernet is a protocol that emerged in the 1970s. It can operate in layers 1 and 2 in the OSI model. This protocol includes features such as signaling in the first layer and defining frame formats in the second layer.Ethernet was developed by a company called Xerox Parc between 1973 and 1975. In 1975, when the protocol was completed, a patent application was filed. In 1976, the first draft text for this protocol was prepared. The first draft model included a data rate of 3Mbps and 8 Bit source and destination address fields.Robert Metcalfe, one of the developers of the protocol, founded 3COM in 1979. Through Robert, who convinced DEC, Intel and Xerox to develop Ethernet as the “DIX” standard, the first Ethernet draft was published by the IEEE in 1980. After a 3-year hiatus, it was adopted by the IEEE in 1983 as the IEEE 802.3 standard.When these standards were adopted by the IEEE, the Ethernet protocol had a data rate of 10Mbps and a 48 Bit data source and destination address space. The 48 Bit data source and destination address space is the MAC address used today.Ethernet and TopologiesEthernet had a topology like every network. As seen in the first ethernet drafts and as I mentioned in my previous blog post on network topologies, Ethernet used the topology model called “Bus Topology” in the first titles. When a data was sent, all devices connected to the line on the network could receive this data. Old wired telephone lines can be given as an example.When we continue with the first topology designed on Ethernet, we cannot pass without mentioning the cable technology of this topology. The first Ethernet-based cable standards on this topology were 10Base5 and 10Base2.In these cables, 10Base5 can be used up to a maximum of 500 meters. However, 10Base2 can be used up to a maximum of 185 meters.Well, when we examine these cable standards here, we come across a format on the nomenclature. These are naming formats as 10-Base and 5 or 2. Here the 10 part tells us that the cable supports a maximum data rate of 10Mbps, the Base word is “Baseband” and 5 or 2 tells us that 10Base5 has a segment width of 500 meters and 2 in 10Base2 has a maximum segment width of 185 meters.Also good information:  Baseband, when only one signal is transmitted on a cable at the same time, the word Base is used in the nomenclature to be Baseband. It means that a single signal or frequency is transmitted on a single cable. If a second signal is sent on the cable contrary to the Bus topology, then the collision process we call Collision occurs. To avoid these collisions, cables with Broadband technology should be used, not Baseband. An example of this is the cables used to display images to televisions at home. Cables used for TVs can carry different signals on a single cable. The best example of this is that the signals of different channels come on the television at the same time and we can get it over a single cable.Continuing from where we left off, in this topology model, a connector called BNC-T is used to connect the computers to each other. Topology is provided through this Connector. After all computers are connected and the networking process is completed, the process is terminated by attaching the terminators called BNC Terminators to the cable end. If this termination process is not done at the end of the cabling, the data transmitted on the cable is reflected back and collision occurs. Well, since we are talking about the issue we call collision, we cannot do without mentioning CSMA/CD, which is a solution to this. So CSMA/CD is next.What is CSMA/CD?In the early days of Ethernet, the devices on the bus topology and connected to the topology provided data transmission via CSMA/CD. CSMA/CD also stands for Collision Detection Carrier Listening Multiple Access. However, in a nutshell, its main task is to detect whether there is Collision or not, hence the name Collision Detector.In this method, when a device wants to send data over the topology, it is detected whether there is active data transport in the topology via CSMA/CD. The tasks here are CS to determine whether the communication line is suitable for sending data, MA to prevent other devices on the topology from sending data except the device sending and receiving the data, and even to ensure that only the devices sending and receiving data remain in communication, and CD to detect the collision of data sent by devices sending data at the same time when the line of devices connected to the topology is long. This is how CSMA/CD comes into existence.CSMA/CD sends a JAM signal in order to provide MA (Multiple Access) on the topology and the communication of other devices on the network is stopped except for the device sending and receiving data.A little information:  The more devices connected to each other on the topology, the higher the probability of Collision. This is not only due to the connected device, but also due to the length of the cable and if there is a fault in the cable. As we remember, in case of a cable failure, the signal is not attenuated by the signal attenuator, so the signal is reflected back and Collision occurs again.So we talked about this Bus topology and Collision. If it is such a problematic topology, why didn’t we switch to another topology, right? Yes, we did. Yes. As a solution to such problems, Star Topology was adopted, taking into account the disadvantages of 10Base2 and 10Base5. As it is less costly and more advantageous compared to Bus, Bus was abandoned and Star topology was started to be used.OK, we have seen Collision in the disadvantages of Bus, we have seen Collision in Cables, but there are also areas. You can think of these areas as domains. The domain of Collision. Let’s continue without much ado. What is Collision Domain?What is Collision Domain?In the early days of Ethernet, we often saw that there could be data collision between devices created with Bus Topology. However, there are domains as a result of signal collision. Now let’s continue in order.Single Collision Domain:In case of a collision in the topology, if all devices in the topology are affected, then the domain of the collision is called Single Collision Domain. In bus topology, since all devices are connected to a single cable and if a signal collision occurs in this topology, we call it a single collision.Broadcast Domain:In this area, if the broadcast sent in the topology is received by all devices, we call this topology a broadcast domain. There may be a concept confusion here. Broadcast Domain is also Single Collision Domain. However, Broadcast Domain is also Single Collision Domain. It is complicated but understandable. I will talk about this in more detail later. Now let’s continue over Ethernet and move on to Ethernet Cable Types.Ethernet Cable TypesWe examined the 10Base2 and 10Base5 cable types used on the Bus topology created in the early days of Ethernet. Then, when we progressed through the Star topology, we met Twisted Pair Cables. When we progressed through the Star Topology, standards were created in this topology, just like the Bus. 10BaseT used in this topology was standardized in 1990. In these standards, the maximum cable length is limited to 100 meters. It is Baseband and supports up to 10Mbps data rate. In addition, as in the same Bus standards, the expression T, which replaces the expression 2 or 5, indicates that we have Twisted Pair.Here 10BaseT is divided into two. These are UTP and STP. If I summarize it simply;UTP: means Unshielded Twisted Cable, STP means Shielded Twisted Cable. which, technically speaking, consists of 4 pairs of 2 cables. Twisted is one of the most basic elements to prevent frequency collision. RJ45 connector is used as a connector. RJ45 also has 2 different pin placement types in the same way. You can examine in detail from the picture below.However, these were not very up-to-date today. Since automatic MDI and MDIX have been introduced, data flow and connection can be provided on the same connector whether it is T568A or T568B. Now let’s continue with the last part of our Network 101 series, MAC Address.MAC AddressWhen defining Ethernet, I have already mentioned that Ethernet works on both layer 1 and layer 2. When Ethernet standards are accepted, not only layer 1 but also layer 2 is accepted. Ethernet has a MAC address in the data link layer.What is MAC Address?MAC, or Media Access Control Address, can also be referred to as physical address or hardware address. MAC Address is not only available on Ethernet. MAC Addresses:  Ethernet,  Token Ring,  Wi-Fi,  BluetoothIt is also used in protocols such asMAC Address is a value consisting of 48 bits and 6 bytes and is uniq for each network card. This value is given to the network cards by the hardware manufacturer. MAC Address consists of 6 bytes. The first 3 bytes represent the manufacturer and the other 3 bytes are the unique code given to the hardware produced by the company.What is the Role of the MAC Address?MAC Address enables network devices to communicate in local networks. It is not a value carried outside the network. When a device wants to establish a connection with another device in the network, it does this through the MAC Address. Briefly, this addressing method is used to identify and communicate with the device that will send the data and the device that will receive the data when two devices communicate with each other within the same network.If you are here, it means that you now have a basic level of Network knowledge. The important thing here is not that you have come this far, but that you are evaluating all this information I have written in a way that will benefit you. As much as I could, I tried to convey the Network 101 series to you in a fluent, understandable and plotted way. Hope to see you with the Network 102 series.",
            "content_html": "<p><img src=\"/images/network-4/main.png\" /></p><blockquote>  <p>Hello everyone with a new blog post! I am here with the 4th blog post of the network basics series. Have a good read in advance.</p></blockquote><h2 id=\"summary\">Summary</h2><p>In this blog post, we will continue with the TCP, UDP Protocols and TCP/IP Model that we have already covered, and we will move on to the basic concept of Ethernet. Let’s make a quick start to this article, starting with the history of Ethernet and extending to the MAC address.</p><h2 id=\"ethernet-and-the-history-of-ethernet\">Ethernet and the History of Ethernet</h2><p>Ethernet is a protocol that emerged in the 1970s. It can operate in layers 1 and 2 in the OSI model. This protocol includes features such as signaling in the first layer and defining frame formats in the second layer.</p><p>Ethernet was developed by a company called Xerox Parc between 1973 and 1975. In 1975, when the protocol was completed, a patent application was filed. In 1976, the first draft text for this protocol was prepared. The first draft model included a data rate of 3Mbps and 8 Bit source and destination address fields.</p><p>Robert Metcalfe, one of the developers of the protocol, founded 3COM in 1979. Through Robert, who convinced DEC, Intel and Xerox to develop Ethernet as the “DIX” standard, the first Ethernet draft was published by the IEEE in 1980. After a 3-year hiatus, it was adopted by the IEEE in 1983 as the IEEE 802.3 standard.</p><p>When these standards were adopted by the IEEE, the Ethernet protocol had a data rate of 10Mbps and a 48 Bit data source and destination address space. The 48 Bit data source and destination address space is the MAC address used today.</p><h2 id=\"ethernet-and-topologies\">Ethernet and Topologies</h2><p>Ethernet had a topology like every network. As seen in the first ethernet drafts and as I mentioned in my previous blog post on network topologies, Ethernet used the topology model called “Bus Topology” in the first titles. When a data was sent, all devices connected to the line on the network could receive this data. Old wired telephone lines can be given as an example.</p><p>When we continue with the first topology designed on Ethernet, we cannot pass without mentioning the cable technology of this topology. The first Ethernet-based cable standards on this topology were 10Base5 and 10Base2.</p><p>In these cables, 10Base5 can be used up to a maximum of 500 meters. However, 10Base2 can be used up to a maximum of 185 meters.</p><p>Well, when we examine these cable standards here, we come across a format on the nomenclature. These are naming formats as 10-Base and 5 or 2. Here the 10 part tells us that the cable supports a maximum data rate of 10Mbps, the Base word is “Baseband” and 5 or 2 tells us that 10Base5 has a segment width of 500 meters and 2 in 10Base2 has a maximum segment width of 185 meters.</p><p>Also good information:</p><blockquote>  <p>Baseband, when only one signal is transmitted on a cable at the same time, the word Base is used in the nomenclature to be Baseband. It means that a single signal or frequency is transmitted on a single cable. If a second signal is sent on the cable contrary to the Bus topology, then the collision process we call Collision occurs. To avoid these collisions, cables with Broadband technology should be used, not Baseband. An example of this is the cables used to display images to televisions at home. Cables used for TVs can carry different signals on a single cable. The best example of this is that the signals of different channels come on the television at the same time and we can get it over a single cable.</p></blockquote><p>Continuing from where we left off, in this topology model, a connector called BNC-T is used to connect the computers to each other. Topology is provided through this Connector. After all computers are connected and the networking process is completed, the process is terminated by attaching the terminators called BNC Terminators to the cable end. If this termination process is not done at the end of the cabling, the data transmitted on the cable is reflected back and collision occurs. Well, since we are talking about the issue we call collision, we cannot do without mentioning CSMA/CD, which is a solution to this. So CSMA/CD is next.</p><h2 id=\"what-is-csmacd\">What is CSMA/CD?</h2><p>In the early days of Ethernet, the devices on the bus topology and connected to the topology provided data transmission via CSMA/CD. CSMA/CD also stands for Collision Detection Carrier Listening Multiple Access. However, in a nutshell, its main task is to detect whether there is Collision or not, hence the name Collision Detector.</p><p>In this method, when a device wants to send data over the topology, it is detected whether there is active data transport in the topology via CSMA/CD. The tasks here are CS to determine whether the communication line is suitable for sending data, MA to prevent other devices on the topology from sending data except the device sending and receiving the data, and even to ensure that only the devices sending and receiving data remain in communication, and CD to detect the collision of data sent by devices sending data at the same time when the line of devices connected to the topology is long. This is how CSMA/CD comes into existence.</p><p>CSMA/CD sends a JAM signal in order to provide MA (Multiple Access) on the topology and the communication of other devices on the network is stopped except for the device sending and receiving data.</p><p>A little information:</p><blockquote>  <p>The more devices connected to each other on the topology, the higher the probability of Collision. This is not only due to the connected device, but also due to the length of the cable and if there is a fault in the cable. As we remember, in case of a cable failure, the signal is not attenuated by the signal attenuator, so the signal is reflected back and Collision occurs again.</p></blockquote><p>So we talked about this Bus topology and Collision. If it is such a problematic topology, why didn’t we switch to another topology, right? Yes, we did. Yes. As a solution to such problems, Star Topology was adopted, taking into account the disadvantages of 10Base2 and 10Base5. As it is less costly and more advantageous compared to Bus, Bus was abandoned and Star topology was started to be used.</p><p>OK, we have seen Collision in the disadvantages of Bus, we have seen Collision in Cables, but there are also areas. You can think of these areas as domains. The domain of Collision. Let’s continue without much ado. What is Collision Domain?</p><h2 id=\"what-is-collision-domain\">What is Collision Domain?</h2><p>In the early days of Ethernet, we often saw that there could be data collision between devices created with Bus Topology. However, there are domains as a result of signal collision. Now let’s continue in order.</p><h3 id=\"single-collision-domain\">Single Collision Domain:</h3><p>In case of a collision in the topology, if all devices in the topology are affected, then the domain of the collision is called Single Collision Domain. In bus topology, since all devices are connected to a single cable and if a signal collision occurs in this topology, we call it a single collision.</p><h3 id=\"broadcast-domain\">Broadcast Domain:</h3><p>In this area, if the broadcast sent in the topology is received by all devices, we call this topology a broadcast domain. There may be a concept confusion here. Broadcast Domain is also Single Collision Domain. However, Broadcast Domain is also Single Collision Domain. It is complicated but understandable. I will talk about this in more detail later. Now let’s continue over Ethernet and move on to Ethernet Cable Types.</p><h2 id=\"ethernet-cable-types\">Ethernet Cable Types</h2><p>We examined the 10Base2 and 10Base5 cable types used on the Bus topology created in the early days of Ethernet. Then, when we progressed through the Star topology, we met Twisted Pair Cables. When we progressed through the Star Topology, standards were created in this topology, just like the Bus. 10BaseT used in this topology was standardized in 1990. In these standards, the maximum cable length is limited to 100 meters. It is Baseband and supports up to 10Mbps data rate. In addition, as in the same Bus standards, the expression T, which replaces the expression 2 or 5, indicates that we have Twisted Pair.</p><p>Here 10BaseT is divided into two. These are UTP and STP. If I summarize it simply;UTP: means Unshielded Twisted Cable, STP means Shielded Twisted Cable. which, technically speaking, consists of 4 pairs of 2 cables. Twisted is one of the most basic elements to prevent frequency collision. RJ45 connector is used as a connector. RJ45 also has 2 different pin placement types in the same way. You can examine in detail from the picture below.</p><p><img src=\"/images/network-4/rj45.png\" /></p><p>However, these were not very up-to-date today. Since automatic MDI and MDIX have been introduced, data flow and connection can be provided on the same connector whether it is T568A or T568B. Now let’s continue with the last part of our Network 101 series, MAC Address.</p><h2 id=\"mac-address\">MAC Address</h2><p>When defining Ethernet, I have already mentioned that Ethernet works on both layer 1 and layer 2. When Ethernet standards are accepted, not only layer 1 but also layer 2 is accepted. Ethernet has a MAC address in the data link layer.</p><h4 id=\"what-is-mac-address\">What is MAC Address?</h4><p>MAC, or Media Access Control Address, can also be referred to as physical address or hardware address. MAC Address is not only available on Ethernet. MAC Addresses:</p><ul>  <li>Ethernet,</li>  <li>Token Ring,</li>  <li>Wi-Fi,</li>  <li>Bluetooth</li></ul><p>It is also used in protocols such as</p><p>MAC Address is a value consisting of 48 bits and 6 bytes and is uniq for each network card. This value is given to the network cards by the hardware manufacturer. MAC Address consists of 6 bytes. The first 3 bytes represent the manufacturer and the other 3 bytes are the unique code given to the hardware produced by the company.</p><h4 id=\"what-is-the-role-of-the-mac-address\">What is the Role of the MAC Address?</h4><p>MAC Address enables network devices to communicate in local networks. It is not a value carried outside the network. When a device wants to establish a connection with another device in the network, it does this through the MAC Address. Briefly, this addressing method is used to identify and communicate with the device that will send the data and the device that will receive the data when two devices communicate with each other within the same network.</p><p>If you are here, it means that you now have a basic level of Network knowledge. The important thing here is not that you have come this far, but that you are evaluating all this information I have written in a way that will benefit you. As much as I could, I tried to convey the Network 101 series to you in a fluent, understandable and plotted way. Hope to see you with the Network 102 series.</p>",
            "url": "http://localhost:4000/ethernet-csma-cd-and-mac-address",
            "image": {"path":"images/network-4/main.png","height":300,"width":1200},
            
            
            "tags": ["cyber","security","network","topologies","mac","ethernet","CSMA/CD","collision"],
            
            "date_published": "2022-04-01T00:00:00+03:00",
            "date_modified": "2022-04-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/tcp-udp-and-tcp-ip-model",
            "title": "TCP, UDP Protocols and TCP/IP Model",
            "summary": null,
            "content_text": "Hello everyone with a new blog post! I am here with the 3rd blog post of the network basics series. Have a good read in advance.SummaryIn the last blog post, we have covered in detail what the OSI Reference Model is and which applications and protocols work at which layers. In this blog post, we will first cover TCP and UDP and then the TCP/IP Model. Finally, under the title Encapsulation, we will give a detailed meaning to the transmission of data.What is TCP Protocol?TCP is a data transfer protocol known as Transmission Control Protocol. Its main purpose is to divide the data it receives from the Application layer into smaller segments for transmission over the network.What are the Features of the TCP Protocol?The TCP Protocol has basically 4 characteristics. These are the following  It is a secure protocol,  Data integrity is a priority,  Flow control is ensured,  It is a connection-based protocol,  It uses the Three Way Handshake method.So if we examine the features of the TCP Protocol.TCP is a completely duplex and secure protocol. It has a structure that checks whether the sent data has reached its destination and whether it has been transmitted.Due to the structure of the TCP Protocol, the transmitter waits for confirmation from the receiver that it has received the segments it has sent. If confirmation is received from the receiver, the continuation segments are transmitted. Thus, it provides a secure data flow by checking the integrity of the data and whether it is transmitted to the other party.Each data sent over TCP has a sequence number. Taking into account the disruptions that may occur on the network due to the provision of the control mechanism in the segments going from the transmitter to the receiver, the integrity of the data is ensured by transmitting the segments that cannot be transmitted when the sequence-based transmission is completed in the data process.What is UDP Protocol?UDP is known as User Datagram Protocol. It has fundamental differences compared to TCP. However, both protocols are used today as data transfer protocols. So what are the features of the UDP Protocol? Let’s examine it quickly.What are the Characteristics of the UDP Protocol?If we give a list again in the same way as in the TCP Protocol, UDP:  Not secure.  Flow control is not provided.  It is a connectionless protocol.This protocol, like TCP, is a protocol for data transfer by dividing the data coming from the upper layers. In UDP, the divided data is called a datagram, not like TCP. Datagrams are less in size than segments. It is faster than TCP due to its lower bandwidth.UDP is not secure. UDP controls the data, just like TCP, but it does not control whether the data reaches the receiver like TCP does. There is no control mechanism in UDP. UDP also does not provide flow control. Therefore, it can transfer data without the need to establish a connection.What are the Differences Between TCP and UDP?Although both are designed for different purposes, they have some fundamental differences. Here are some key features to explain the differences between TCP and UDP:1. Connection management:  TCP starts with a connection establishment phase before data transmission.  UDP allows data to be sent directly without connection establishment.2. Reliability:  TCP prioritizes reliability in data transmission.  UDP provides fast and direct data transfer, but with a low level of reliability.3. Data integrity:  TCP uses checksums to ensure data integrity.  UDP has no checksum to check data integrity.4. Data flow control:  TCP manages the flow of data and performs flow control to avoid congestion.  UDP does not control data flow.5. Disconnection:  TCP ensures that both parties are notified before disconnecting and that the connection is terminated correctly.  UDP uses no special protocol for disconnection, it just abruptly ends the connection.6. Uses:  TCP is preferred for applications that require reliable data transfer. For example, downloading web pages, sending e-mail and transferring files.  UDP is preferred for applications that require fast data transfer. For example, games, broadcasts, video and audio streaming.          After a quick review of the TCP and UDP Protocols, let’s move on to our next topic, the TCP/IP Protocol.      What is the TCP/IP Protocol?When we look at the history of this model, this model was created by the US Department of Defense in the 1980s and continues to be developed. The TCP/IP Protocol has similar headings as the OSI Reference model. However, it has fewer layers and most layers look like a combination of the OSI Reference model.As can be seen above, there are 4 layers in the TCP/IP Model. These layers are:  Application Layer,  Transport Layer,  Internet Layer,  Network Layer.There are 4 layers.The TCP/IP Model is a two-layer communication protocol. It ensures that the data in the upper layers are separated into packets before transmission and the data are reassembled at the receiver. The lower layers control the routing of the transmitted packets to the desired network address. In the TCP/IP Model, a new protocol can be easily inserted between layers. In the same way, an unused layer can be easily removed.After the basics, it is time to examine the transmission of data under OSI, TCP/IP and Encapsulation. So let’s take a quick look.Transmission of Data over the OSI ModelIf we examine how data generated by users is transmitted in the protocols on the OSI and TCP/IP Model, we basically need to go into the reasons for the emergence of protocols.The main reason for the creation of these protocols is that these structures were derived so that the products produced by different manufacturers could work fully integrated by the users.As a result of the studies, the OSI and TCP/IP Models, which are widely used today, have emerged.When these models were derived, models based on layers and protocols emerged. By creating transition data between layers, it is also prevented that an improvement that can be created on the layers will affect other layers. So let’s quickly move on to OSI.Data Transmission in the OSI Model:On the OSI Model, as the data moves between layers, certain information is transmitted to a lower or upper layer. The process that occurs in the data transmitted from the lower layer to the upper layer is called Encapsulation.In the OSI Model, if a data is not transmitted from lower layers to upper layers, but from upper layer to lower layer, this process is called De-encapsulation. Thus, we have finished the data integration and fragmentation in the OSI Model in this blog post.Hope to see you in the next blog post.",
            "content_html": "<hr /><p><img src=\"/images/network-3/main.png\" alt=\"HEAD\" /></p><p>Hello everyone with a new blog post! I am here with the 3rd blog post of the network basics series. Have a good read in advance.</p><h2 id=\"summary\">Summary</h2><p>In the last blog post, we have covered in detail what the OSI Reference Model is and which applications and protocols work at which layers. In this blog post, we will first cover TCP and UDP and then the TCP/IP Model. Finally, under the title Encapsulation, we will give a detailed meaning to the transmission of data.</p><h2 id=\"what-is-tcp-protocol\">What is TCP Protocol?</h2><p>TCP is a data transfer protocol known as Transmission Control Protocol. Its main purpose is to divide the data it receives from the Application layer into smaller segments for transmission over the network.</p><h3 id=\"what-are-the-features-of-the-tcp-protocol\">What are the Features of the TCP Protocol?</h3><p>The TCP Protocol has basically 4 characteristics. These are the following</p><ul>  <li>It is a secure protocol,</li>  <li>Data integrity is a priority,</li>  <li>Flow control is ensured,</li>  <li>It is a connection-based protocol,</li>  <li>It uses the Three Way Handshake method.</li></ul><p>So if we examine the features of the TCP Protocol.</p><p>TCP is a completely duplex and secure protocol. It has a structure that checks whether the sent data has reached its destination and whether it has been transmitted.</p><p>Due to the structure of the TCP Protocol, the transmitter waits for confirmation from the receiver that it has received the segments it has sent. If confirmation is received from the receiver, the continuation segments are transmitted. Thus, it provides a secure data flow by checking the integrity of the data and whether it is transmitted to the other party.</p><p>Each data sent over TCP has a sequence number. Taking into account the disruptions that may occur on the network due to the provision of the control mechanism in the segments going from the transmitter to the receiver, the integrity of the data is ensured by transmitting the segments that cannot be transmitted when the sequence-based transmission is completed in the data process.</p><h2 id=\"what-is-udp-protocol\">What is UDP Protocol?</h2><p>UDP is known as User Datagram Protocol. It has fundamental differences compared to TCP. However, both protocols are used today as data transfer protocols. So what are the features of the UDP Protocol? Let’s examine it quickly.</p><h3 id=\"what-are-the-characteristics-of-the-udp-protocol\">What are the Characteristics of the UDP Protocol?</h3><p>If we give a list again in the same way as in the TCP Protocol, UDP:</p><ul>  <li>Not secure.</li>  <li>Flow control is not provided.</li>  <li>It is a connectionless protocol.</li></ul><p>This protocol, like TCP, is a protocol for data transfer by dividing the data coming from the upper layers. In UDP, the divided data is called a datagram, not like TCP. Datagrams are less in size than segments. It is faster than TCP due to its lower bandwidth.</p><p>UDP is not secure. UDP controls the data, just like TCP, but it does not control whether the data reaches the receiver like TCP does. There is no control mechanism in UDP. UDP also does not provide flow control. Therefore, it can transfer data without the need to establish a connection.</p><h3 id=\"what-are-the-differences-between-tcp-and-udp\">What are the Differences Between TCP and UDP?</h3><p>Although both are designed for different purposes, they have some fundamental differences. Here are some key features to explain the differences between TCP and UDP:</p><p><strong>1. Connection management:</strong></p><ul>  <li>TCP starts with a connection establishment phase before data transmission.</li>  <li>UDP allows data to be sent directly without connection establishment.<br /></li></ul><p><strong>2. Reliability:</strong></p><ul>  <li>TCP prioritizes reliability in data transmission.</li>  <li>UDP provides fast and direct data transfer, but with a low level of reliability.<br /></li></ul><p><strong>3. Data integrity:</strong></p><ul>  <li>TCP uses checksums to ensure data integrity.</li>  <li>UDP has no checksum to check data integrity.<br /></li></ul><p><strong>4. Data flow control:</strong></p><ul>  <li>TCP manages the flow of data and performs flow control to avoid congestion.</li>  <li>UDP does not control data flow.<br /></li></ul><p><strong>5. Disconnection:</strong></p><ul>  <li>TCP ensures that both parties are notified before disconnecting and that the connection is terminated correctly.</li>  <li>UDP uses no special protocol for disconnection, it just abruptly ends the connection.<br /></li></ul><p><strong>6. Uses</strong>:</p><ul>  <li>TCP is preferred for applications that require reliable data transfer. For example, downloading web pages, sending e-mail and transferring files.</li>  <li>UDP is preferred for applications that require fast data transfer. For example, games, broadcasts, video and audio streaming.<br /><br />    <blockquote>      <p>After a quick review of the TCP and UDP Protocols, let’s move on to our next topic, the TCP/IP Protocol.</p>    </blockquote>  </li></ul><h2 id=\"what-is-the-tcpip-protocol\">What is the TCP/IP Protocol?</h2><p>When we look at the history of this model, this model was created by the US Department of Defense in the 1980s and continues to be developed. The TCP/IP Protocol has similar headings as the OSI Reference model. However, it has fewer layers and most layers look like a combination of the OSI Reference model.</p><p><img src=\"/images/network-3/image-1.png\" alt=\"image-1\" /></p><p>As can be seen above, there are 4 layers in the TCP/IP Model. These layers are:</p><ul>  <li>Application Layer,</li>  <li>Transport Layer,</li>  <li>Internet Layer,</li>  <li>Network Layer.</li></ul><p>There are 4 layers.</p><p>The TCP/IP Model is a two-layer communication protocol. It ensures that the data in the upper layers are separated into packets before transmission and the data are reassembled at the receiver. The lower layers control the routing of the transmitted packets to the desired network address. In the TCP/IP Model, a new protocol can be easily inserted between layers. In the same way, an unused layer can be easily removed.</p><p>After the basics, it is time to examine the transmission of data under OSI, TCP/IP and Encapsulation. So let’s take a quick look.</p><h2 id=\"transmission-of-data-over-the-osi-model\">Transmission of Data over the OSI Model</h2><p>If we examine how data generated by users is transmitted in the protocols on the OSI and TCP/IP Model, we basically need to go into the reasons for the emergence of protocols.</p><p>The main reason for the creation of these protocols is that these structures were derived so that the products produced by different manufacturers could work fully integrated by the users.</p><p>As a result of the studies, the OSI and TCP/IP Models, which are widely used today, have emerged.</p><p>When these models were derived, models based on layers and protocols emerged. By creating transition data between layers, it is also prevented that an improvement that can be created on the layers will affect other layers. So let’s quickly move on to OSI.</p><h3 id=\"data-transmission-in-the-osi-model\">Data Transmission in the OSI Model:</h3><p><img src=\"/images/network-3/image-2.png\" alt=\"image-1\" /></p><p>On the OSI Model, as the data moves between layers, certain information is transmitted to a lower or upper layer. The process that occurs in the data transmitted from the lower layer to the upper layer is called Encapsulation.</p><p>In the OSI Model, if a data is not transmitted from lower layers to upper layers, but from upper layer to lower layer, this process is called De-encapsulation. Thus, we have finished the data integration and fragmentation in the OSI Model in this blog post.</p><p>Hope to see you in the next blog post.</p>",
            "url": "http://localhost:4000/tcp-udp-and-tcp-ip-model",
            "image": {"path":"images/network-3/main.png","height":300,"width":1200},
            
            
            "tags": ["cyber","security","network","protocols","tcp","udp"],
            
            "date_published": "2022-03-01T00:00:00+03:00",
            "date_modified": "2022-03-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/basic-network-what-is-osi-reference-model-and-osi-layers",
            "title": "OSI Reference Model and OSI Layer",
            "summary": null,
            "content_text": "Hello everyone with a new blog post! Today I am here with the second post of our blog series called Network Basics. Have a good read.SummaryIn the last blog post, I shared with you the basic network concepts, What is Network? What are Network Protocols? I ended the blog post by examining Network Topology and five sample topology models. In today’s post, I will share with you What is the OSI Reference Model? What are the Network Layers? I will touch on many topics under the main headings, so let’s continue.What is the OSI Reference Model?With the introduction of the network concept into our lives and the establishment of communication between devices, many technology companies have started to develop network protocols. However, each manufacturer has developed devices and protocols based on its own product and its own protocol. However, problems such as protocol incompatibility between different brands of devices that serve the same purpose have entered our lives as a problem brought about by the development of hardware and software based on their own products.In order to solve such problems between their own products, developers developed an architecture created by IBM in 1974 and named IBM SNA (System Network Architecture), which is like the OSI Reference Model but not exactly the same. In the same years, Digital also developed an architecture called Digital Equipment Corporation Network, which they called DECNET.However, the problem of protocol incompatibility of different brand devices with other different brand devices in the demand part of the consumer side and the search for a solution to this by both consumers and manufacturers laid the foundation of the OSI Reference Model.In 1983, the International Standards Organization adopted OSI, also known as Open System Interconnection, and announced it to the world as a standard.After a brief look at the history of the OSI Reference Model, let’s get to know the layers.What are the OSI Layers?The first thing we need to know about OSI is how many layers the OSI Reference Model consists of and which layer performs which functions. The OSI Reference model consists of 7 layers. I will touch on this part in a moment, but briefly, a data coming to the device first passes through 7 layers, this is called Encapsulation. With another example, when the data leaves our device, it follows the path we call encapsulation and is sent through the OSI layers in the opposite direction of arrival. You may be confused but stay calm. I will explain all layers in detail.Layer 1 - Physical Layer:When you look at the Physical layer in the OSI Reference model, it can also be described as the layer that defines how the data will be transmitted. In our previous blog post, I listed 3 separate items on how data can be transmitted. Let’s quickly remember,  Ethernet,  Fiber Cable,  WirelessData is transmitted between devices in these 3 different ways. Data is carried between the layers in Binary as 1 and 0.Layer 2 - Data Link Layer:In the OSI Reference model, the data link layer has a more complex structure than the previous topic, the physical layer. In this layer, the data transmitted from the network layer is fragmented and error control bytes are added between them to form a Frame and transmitted to the destination address. The Frame allows the Data Link layer to receive the packets that it sends and receives between itself as a bulk packet, just as each layer has its own unique packet. When we look at the Frame types in this layer,  802.2 Ethernet,  802.3 Ethernet,  802.4 Token Bus,  802.5 Token Ring.If we need to give examples among these, the Ring and Bus topologies in the title of network topologies that we examined in our previous blog post come to mind. There is no need to go into detail because they are not topologies and frames that are widely used today.The most commonly used frame type in Layer 2 today is the frame called 802.3 Ethernet. So what does this frame offer us? Let’s analyze it.802.3 Ethernet Frame:As you can see in the picture above, the structure of a frame sent from L2 is shown. Ethernet 2 frame has a common structure that works on Layer 1 and Layer 2. If we look at this frame specifically, the parts that work on Layer 1 are as follows,  Preamble,  (SFD) Start Frame Delimiter,      (CRC) Frame Check SequenceThese parts in the frame are the parts that are related to Layer 1. Let’s summarize these sections briefly.    Preamble: It is the beginning part of the frame. It occupies 7 bytes of space.  SFD: This is the constraint of the start section. It occupies 1 byte.  CRC: This is the space between the frame and another frame. It occupies 12 bytes.Well, if we talk about the tasks of the layers in Layer 2 that carry the data;  Destination MAC Address: It is the part that contains the destination MAC address. It occupies 6 bytes of space.  Source MAC Address: It is the part that contains the source MAC address. It occupies 6 bytes.  Ether Type: This part specifies which protocol the next packet section, the payload, belongs to. It occupies 2 bytes.Finally, let me explain the part that carries the data in the frame, which we call payload.  Data or Payload: The data in this section contains the data belonging to the protocol to which the data in the Ether Type I mentioned in the previous section belongs. For example IP, ARP etc. This field can contain data between 46 and 1500 bytes.Since we have covered 802.3 Ethernet in detail, let’s continue our topic from Layer 2.A very large part of the Data Link layer runs on the network card in the device. There are also 2 sub-layers of Layer 2.  MAC (Media Accsess Control),  LLC (Logical Link Control).In these two sub-layers, they work with the Data Link layer, which is the upper layer. As additional information, there is a hardware device called Switch as an example of the hardware working at this layer. This device ensures that the data is transmitted to the correct destination by matching the connected devices according to their MAC addresses.Layer 3 - Network Layer:Another layer after Layer 2 is Layer 3 Network Layer. In this layer, the packets that we characterized as Frame in the previous title are transformed into network packets at Layer 3 by adding L3 Header. This layer is responsible for sending data packets to another network. While this is being done, addressing and routing operations also take place at the network layer.Addressing:The network layer inherently operates an addressing mechanism between the source computer and the destination computer. According to this addressing mechanism, each device must have a unique address to ensure that each data packet is sent to the correct destination. These addresses must be unique. In short, this addressing mechanism is called the IP mechanism.The protocols used and supported at this layer are as follows,  IP (Internet Protocol, IPv4 and IPv6),  IPX (Internetwork Packet Exchange),  ARP (Address Resolution Protocol),  ICMP (Internet Control Message Protocol).Routing:Routers called R1, R2 and R3, shown in the diagram, are used to send data to a different device in the same network. Routers read the data in the L3 data packet to determine which destination device the data should go to and direct it to the destination.The protocols used and supported at this layer are as follows,  RIP (Routing Information Protocol),  EIGRP (Enchanged Interior Gateway Routing Protocol),  OSPF (Open Short Path First),  BGP (Border Gateway Protocol).Layer 4 - Transport Layer:The transport layer is the 4th and one of the most important layers of the OSI Reference Model, in fact it is the heart of the OSI Reference Model. The task of this layer is, if it receives data from an upper layer, it divides the data into parts and transmits it to the lower layer. If it receives data from a lower layer, it combines the data and transmits it to the upper layer.It receives data from the lower layer as a packet and transmits it to the upper layer as a segment. It receives data from the upper layer as a segment and transmits it as data to the lower layer.Layer 5 - Session LayerSession Layer, the 5th layer of the OSI Reference Model, manages the establishment, management and termination of connections between applications. The dialog in the data flow between two applications is provided at this layer. Session Layer provides the following:  Setup,  Management,  TerminationSince the dialog between two applications in this layer also includes communications with different devices, its most important feature is that it transmits the dialog between the client and the server without mixing it with communications with other devices.Session Layer contains 4 different protocols. These protocols are as follows:  NetBIOS  RPC  SIP  SDPSo let’s take a quick look at these 4 protocols.What is NetBIOS?NetBIOS is an API used for devices in the network to communicate with each other. NetBIOS allows separate computers to establish a connection over the local network. It serves on the Session Layer, one of the layers that provide the OSI Reference Model.What is RPC?RPC enables communication between a client and a server on a network, within a computer, between a client and a server.What is SIP?SIP is a protocol used to initiate, maintain and terminate synchronous sessions involving messaging applications for audio, video, pictures, etc. within a network.What is SDP?SDP is a protocol that allows the media to be transmitted to the client or server without losing ports in connections containing media based on audio or video transmission over IP in the network.Layer 6 - Presentation LayerThis layer is layer 6 in the OSI reference model. This layer has the task of translating data into formats that computers or devices can process. Some of the data protocols transmitted on the layer are:  GIF,  JPEG,  TIFF,  ASCII,  MPEG.This layer performs basic operations such as encryption, decryption and compression of data.Layer 7 - Application LayerThis layer is the last layer of the OSI Reference Model. The main feature of this layer is that it does not provide any services to the layers below it. Some protocols running at this layer are:  SSH,  FTP,  HTTP,  DNS,  SMTP.For example, protocols such as SSH, which are necessary for secure web access, are on this layer. Services that host tasks such as forwarding emails etc. are also on this layer.",
            "content_html": "<hr /><p><img src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/Basic%20Network%20OSI%20Reference%20Model%20and%20OSI%20Layers.png\" alt=\"HEAD\" /></p><p>Hello everyone with a new blog post! Today I am here with the second post of our blog series called Network Basics. Have a good read.</p><h2 id=\"summary\">Summary</h2><p>In the last blog post, I shared with you the basic network concepts, What is Network? What are Network Protocols? I ended the blog post by examining Network Topology and five sample topology models. In today’s post, I will share with you What is the OSI Reference Model? What are the Network Layers? I will touch on many topics under the main headings, so let’s continue.</p><h2 id=\"what-is-the-osi-reference-model\">What is the OSI Reference Model?</h2><p>With the introduction of the network concept into our lives and the establishment of communication between devices, many technology companies have started to develop network protocols. However, each manufacturer has developed devices and protocols based on its own product and its own protocol. However, problems such as protocol incompatibility between different brands of devices that serve the same purpose have entered our lives as a problem brought about by the development of hardware and software based on their own products.</p><p>In order to solve such problems between their own products, developers developed an architecture created by IBM in 1974 and named IBM SNA (System Network Architecture), which is like the OSI Reference Model but not exactly the same. In the same years, Digital also developed an architecture called Digital Equipment Corporation Network, which they called DECNET.</p><p>However, the problem of protocol incompatibility of different brand devices with other different brand devices in the demand part of the consumer side and the search for a solution to this by both consumers and manufacturers laid the foundation of the OSI Reference Model.</p><p>In 1983, the International Standards Organization adopted OSI, also known as Open System Interconnection, and announced it to the world as a standard.</p><p>After a brief look at the history of the OSI Reference Model, let’s get to know the layers.</p><p><img style=\"text-align:center\" src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/what-is-osi-referance-model.png\" /></p><h2 id=\"what-are-the-osi-layers\">What are the OSI Layers?</h2><p>The first thing we need to know about OSI is how many layers the OSI Reference Model consists of and which layer performs which functions. The OSI Reference model consists of 7 layers. I will touch on this part in a moment, but briefly, a data coming to the device first passes through 7 layers, this is called Encapsulation. With another example, when the data leaves our device, it follows the path we call encapsulation and is sent through the OSI layers in the opposite direction of arrival. You may be confused but stay calm. I will explain all layers in detail.</p><h4 id=\"layer-1---physical-layer\">Layer 1 - Physical Layer:</h4><p>When you look at the Physical layer in the OSI Reference model, it can also be described as the layer that defines how the data will be transmitted. In our previous blog post, I listed 3 separate items on how data can be transmitted. Let’s quickly remember,</p><ul>  <li>Ethernet,</li>  <li>Fiber Cable,</li>  <li>Wireless</li></ul><p>Data is transmitted between devices in these 3 different ways. Data is carried between the layers in Binary as 1 and 0.</p><h3 id=\"layer-2---data-link-layer\">Layer 2 - Data Link Layer:</h3><p>In the OSI Reference model, the data link layer has a more complex structure than the previous topic, the physical layer. In this layer, the data transmitted from the network layer is fragmented and error control bytes are added between them to form a Frame and transmitted to the destination address. The Frame allows the Data Link layer to receive the packets that it sends and receives between itself as a bulk packet, just as each layer has its own unique packet. When we look at the Frame types in this layer,</p><ul>  <li>802.2 Ethernet,</li>  <li>802.3 Ethernet,</li>  <li>802.4 Token Bus,</li>  <li>802.5 Token Ring.</li></ul><p>If we need to give examples among these, the Ring and Bus topologies in the title of network topologies that we examined in our previous blog post come to mind. There is no need to go into detail because they are not topologies and frames that are widely used today.</p><p>The most commonly used frame type in Layer 2 today is the frame called 802.3 Ethernet. So what does this frame offer us? Let’s analyze it.</p><p><img style=\"text-align:center\" src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/data-link-layer.png\" /></p><h3 id=\"8023-ethernet-frame\">802.3 Ethernet Frame:</h3><p>As you can see in the picture above, the structure of a frame sent from L2 is shown. Ethernet 2 frame has a common structure that works on Layer 1 and Layer 2. If we look at this frame specifically, the parts that work on Layer 1 are as follows,</p><ul>  <li>Preamble,</li>  <li>(SFD) Start Frame Delimiter,</li>  <li>    <p>(CRC) Frame Check Sequence<br /><br />These parts in the frame are the parts that are related to Layer 1. Let’s summarize these sections briefly.</p>  </li>  <li>Preamble: It is the beginning part of the frame. It occupies 7 bytes of space.</li>  <li>SFD: This is the constraint of the start section. It occupies 1 byte.</li>  <li>CRC: This is the space between the frame and another frame. It occupies 12 bytes.<br /><br /></li></ul><p>Well, if we talk about the tasks of the layers in Layer 2 that carry the data;</p><ul>  <li>Destination MAC Address: It is the part that contains the destination MAC address. It occupies 6 bytes of space.</li>  <li>Source MAC Address: It is the part that contains the source MAC address. It occupies 6 bytes.</li>  <li>Ether Type: This part specifies which protocol the next packet section, the payload, belongs to. It occupies 2 bytes.<br /><br /></li></ul><p>Finally, let me explain the part that carries the data in the frame, which we call payload.</p><ul>  <li>Data or Payload: The data in this section contains the data belonging to the protocol to which the data in the Ether Type I mentioned in the previous section belongs. For example IP, ARP etc. This field can contain data between 46 and 1500 bytes.<br /><br />Since we have covered 802.3 Ethernet in detail, let’s continue our topic from Layer 2.</li></ul><p>A very large part of the Data Link layer runs on the network card in the device. There are also 2 sub-layers of Layer 2.</p><ul>  <li>MAC (Media Accsess Control),</li>  <li>LLC (Logical Link Control).</li></ul><p>In these two sub-layers, they work with the Data Link layer, which is the upper layer. As additional information, there is a hardware device called Switch as an example of the hardware working at this layer. This device ensures that the data is transmitted to the correct destination by matching the connected devices according to their MAC addresses.</p><h2 id=\"layer-3---network-layer\">Layer 3 - Network Layer:</h2><p>Another layer after Layer 2 is Layer 3 Network Layer. In this layer, the packets that we characterized as Frame in the previous title are transformed into network packets at Layer 3 by adding L3 Header. This layer is responsible for sending data packets to another network. While this is being done, addressing and routing operations also take place at the network layer.<br /><br /><img style=\"text-align:center\" src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/network-layer.png\" /></p><h3 id=\"addressing\">Addressing:</h3><p>The network layer inherently operates an addressing mechanism between the source computer and the destination computer. According to this addressing mechanism, each device must have a unique address to ensure that each data packet is sent to the correct destination. These addresses must be unique. In short, this addressing mechanism is called the IP mechanism.</p><p>The protocols used and supported at this layer are as follows,</p><ul>  <li>IP (Internet Protocol, IPv4 and IPv6),</li>  <li>IPX (Internetwork Packet Exchange),</li>  <li>ARP (Address Resolution Protocol),</li>  <li>ICMP (Internet Control Message Protocol).</li></ul><h3 id=\"routing\">Routing:</h3><p>Routers called R1, R2 and R3, shown in the diagram, are used to send data to a different device in the same network. Routers read the data in the L3 data packet to determine which destination device the data should go to and direct it to the destination.</p><p>The protocols used and supported at this layer are as follows,</p><ul>  <li>RIP (Routing Information Protocol),</li>  <li>EIGRP (Enchanged Interior Gateway Routing Protocol),</li>  <li>OSPF (Open Short Path First),</li>  <li>BGP (Border Gateway Protocol).</li></ul><h2 id=\"layer-4---transport-layer\">Layer 4 - Transport Layer:</h2><p>The transport layer is the 4th and one of the most important layers of the OSI Reference Model, in fact it is the heart of the OSI Reference Model. The task of this layer is, if it receives data from an upper layer, it divides the data into parts and transmits it to the lower layer. If it receives data from a lower layer, it combines the data and transmits it to the upper layer.<br /><br /><img style=\"text-align:center\" src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/transport-layer.png\" /><br /><br />It receives data from the lower layer as a packet and transmits it to the upper layer as a segment. It receives data from the upper layer as a segment and transmits it as data to the lower layer.</p><h2 id=\"layer-5---session-layer\">Layer 5 - Session Layer</h2><p>Session Layer, the 5th layer of the OSI Reference Model, manages the establishment, management and termination of connections between applications. The dialog in the data flow between two applications is provided at this layer. Session Layer provides the following:</p><ul>  <li>Setup,</li>  <li>Management,</li>  <li>Termination</li></ul><p>Since the dialog between two applications in this layer also includes communications with different devices, its most important feature is that it transmits the dialog between the client and the server without mixing it with communications with other devices.</p><p>Session Layer contains 4 different protocols. These protocols are as follows:</p><ul>  <li>NetBIOS</li>  <li>RPC</li>  <li>SIP</li>  <li>SDP</li></ul><p>So let’s take a quick look at these 4 protocols.</p><h4 id=\"what-is-netbios\">What is NetBIOS?</h4><p>NetBIOS is an API used for devices in the network to communicate with each other. NetBIOS allows separate computers to establish a connection over the local network. It serves on the Session Layer, one of the layers that provide the OSI Reference Model.</p><h3 id=\"what-is-rpc\">What is RPC?</h3><p>RPC enables communication between a client and a server on a network, within a computer, between a client and a server.</p><h4 id=\"what-is-sip\">What is SIP?</h4><p>SIP is a protocol used to initiate, maintain and terminate synchronous sessions involving messaging applications for audio, video, pictures, etc. within a network.</p><h4 id=\"what-is-sdp\">What is SDP?</h4><p>SDP is a protocol that allows the media to be transmitted to the client or server without losing ports in connections containing media based on audio or video transmission over IP in the network.</p><h2 id=\"layer-6---presentation-layer\">Layer 6 - Presentation Layer</h2><p>This layer is layer 6 in the OSI reference model. This layer has the task of translating data into formats that computers or devices can process. Some of the data protocols transmitted on the layer are:</p><ul>  <li>GIF,</li>  <li>JPEG,</li>  <li>TIFF,</li>  <li>ASCII,</li>  <li>MPEG.</li></ul><p>This layer performs basic operations such as encryption, decryption and compression of data.</p><h2 id=\"layer-7---application-layer\">Layer 7 - Application Layer</h2><p>This layer is the last layer of the OSI Reference Model. The main feature of this layer is that it does not provide any services to the layers below it. Some protocols running at this layer are:</p><ul>  <li>SSH,</li>  <li>FTP,</li>  <li>HTTP,</li>  <li>DNS,</li>  <li>SMTP.</li></ul><p>For example, protocols such as SSH, which are necessary for secure web access, are on this layer. Services that host tasks such as forwarding emails etc. are also on this layer.</p>",
            "url": "http://localhost:4000/basic-network-what-is-osi-reference-model-and-osi-layers",
            "image": {"path":"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/Basic%20Network%20%20OSI%20Reference%20Model%20and%20OSI%20Layers.png","height":630,"width":1200},
            
            
            "tags": ["cyber","security","network","osi","reference","model","layers"],
            
            "date_published": "2022-02-01T00:00:00+03:00",
            "date_modified": "2022-02-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        },
    
        {
            "id": "http://localhost:4000/basic-network-what-is-network-protocols-and-topologies",
            "title": "Network, Protocols and Topologies",
            "summary": null,
            "content_text": "Hello everyone with a new blog post! As of 2023, I am continuing the series of blog posts that I have been taking a break for a long time. I am here with the first article of the series consisting of 3 blog posts that we call Network Basics, I wish you good reading in advance.What is Network?The first thing we need to know before moving on to network basics is what a network is. So what is Network?Network is the connection of multiple devices to each other in order to share resources. Network enables sharing of resources between devices in software or hardware. For example, if we take examples from a company network, in an office environment where there is no network, an external storage device is needed to transfer the software resource to another computer. Thanks to the network, this need is met by the reliable and fast transmission of the software resource on a common network where computers are connected without the need for an external media or storage device. Of course, this is a very simplified example of file transfer.Another way of looking at it is that in environments without a network based on hardware resources, people still need an external media or storage device to transfer the files they need to hardware devices. Thanks to the network, for example, the output you want to get through a printer is very simple and the network can quickly provide you with a solution thanks to the hardware resource support of the network.Of course, there are some requirements for computers to be connected to each other in networks. For example, there are three different methods used to connect two computers to each other.  Ethernet,  Fiber Cable,  Wireless.I will cover them in detail later, but I wanted to mention them briefly for the sake of knowledge. So, we have learned what we need to use to connect two or more devices to each other. However, we also need to know the protocols necessary to establish communication between devices. So let’s continue with our next topic, Network Protocols.What is a Network Protocol?As everyone knows, people around the world need to know common languages in order to talk to each other and transfer information to each other. Network also works in this way. The network enables communication between two devices, just like people, but first the two devices must be able to speak the same language. Devices in the network can only communicate and transfer information with each other if they use common protocols.I will examine this issue in the OSI Reference Model, which I will cover in detail in my upcoming blog posts. Let’s continue without slowing down and move on to our next topic, What are Network Topologies?Network TopologiesIt is the topology that determines how devices in a network are placed, how they are connected and how they transmit data. Today, it is used in two different ways. It is divided into two as Physical and Logical topology.What is Physical Topology?Physical topology is the topology that determines how the network will physically look like. It determines how the devices and cables in the network should be organized.What is Logical Topology?Logical topology utilizes physical topology to determine how data is transferred.Network engineers need to consider these two topologies when designing a network and place devices and create the network according to these two topologies.Today, the most widely used and known Network Topologies are the design models developed on five sequences. These models are used by network and system engineers in the required environments.As you can see in the picture, 5 different network topologies are shown. These are  Bus Topology  Ring Topology  Star Topology  Tree Topology  Mesh TopologyThey are network configurations named as. The topologies here have pros and cons compared to each other. Let us examine them in order.Bus Topology:In this topology type, communication between devices takes place on a single line. The data transferred on the network goes to all devices until it is transferred to the target device. For this reason, network performance is very low and is not widely preferred today. In addition, the communication type used on this topology is Ethernet.This type of topology is very popular as it can be easily installed on the network. In addition, when an additional device is desired to be connected to the network, it can be easily added. It is economical, and it is possible to create a network without the need for external network devices such as switches or hubs.However, every good thing has some disadvantages. In this topology type, the limited number of devices that can be connected and the limited line length are the main disadvantages.In addition, in this topology, it is difficult to detect failures or errors in the systems installed on the backbone. In addition, when a problem occurs on the network, all devices connected to the network are affected. The data transfer rate is also low.Ring Topology:In this topology type, the data sent on the network is transferred to all devices until it reaches the receiving device. Although it is logically ring-shaped, it actually has similarities with star topology. Although it is logically in the form of a circle, since it physically consists of devices connected to the MAU, it is logically analogized as a ring and physically as a star.As with the bus topology, there are some advantages and disadvantages here.The advantages are that all devices on the network have the same authorization and there is little performance degradation if a device is added to the network.As disadvantages, a malfunction that may occur on a device connected to the network may cause the entire network to become unusable. It is also a very costly topology.Star Topology:Star topology consists of a hub or switch in the center and devices connected to it. In this topology, the data is logically sent to the hub or switch before the device from which the data originates. Then the data is transmitted to the destination device.In this topology, if the network device called hub or switch at the center fails, the connection between the target computers from which the data originates and the target computers to which the data should be transmitted is broken. Ethernet protocol is widely used as a protocol. Devices can also be transmitted via fiber optic cables.In this type of topology, network management and problem detection is easier, and it is also easy to add new devices. The biggest difference compared to the topologies I have mentioned so far is that a problem occurring in the destination or sender device does not affect the network.As disadvantages, a problem in the intermediary network device in the center affects the whole network. It also requires more cable connections.Tree Topology:In this topology, which we call tree topology, devices are connected to each other with two different connection points. This topology is often used to bring together networks in a star topology structure at an upper connection point. Thus, networks can be scaled up.The advantages of this topology are that it is easy to reach each device and the segments they form. The device boundary of each intermediate topology is limited by the cable length. When backbone cables or central devices fail, the network is disrupted. It is difficult to install and organize.Mesh Topology:In this topology, a device connected to the network is connected to all other devices on the network. In this topology, if a problem occurs on one line, the device can maintain the connection through other lines. As an advantage, this topology has the biggest advantage with its high data rate. In addition, when a new device is to be added to the network, it can be easily included.As disadvantages, the number of connections is high. Too many cables are used and the cost is high.After examining our last topology type, Mesh, we have finished the topics I planned for our first blog post today. Hope to see you in my next blog post.",
            "content_html": "<p><img src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/Basic-Network-1.png\" alt=\"HEAD\" /></p><p>Hello everyone with a new blog post! As of 2023, I am continuing the series of blog posts that I have been taking a break for a long time. I am here with the first article of the series consisting of 3 blog posts that we call Network Basics, I wish you good reading in advance.</p><h2 id=\"what-is-network\">What is Network?</h2><p>The first thing we need to know before moving on to network basics is what a network is. So what is Network?</p><p>Network is the connection of multiple devices to each other in order to share resources. Network enables sharing of resources between devices in software or hardware. For example, if we take examples from a company network, in an office environment where there is no network, an external storage device is needed to transfer the software resource to another computer. Thanks to the network, this need is met by the reliable and fast transmission of the software resource on a common network where computers are connected without the need for an external media or storage device. Of course, this is a very simplified example of file transfer.</p><p>Another way of looking at it is that in environments without a network based on hardware resources, people still need an external media or storage device to transfer the files they need to hardware devices. Thanks to the network, for example, the output you want to get through a printer is very simple and the network can quickly provide you with a solution thanks to the hardware resource support of the network.</p><p>Of course, there are some requirements for computers to be connected to each other in networks. For example, there are three different methods used to connect two computers to each other.</p><ul>  <li>Ethernet,</li>  <li>Fiber Cable,</li>  <li>Wireless.</li></ul><p>I will cover them in detail later, but I wanted to mention them briefly for the sake of knowledge. So, we have learned what we need to use to connect two or more devices to each other. However, we also need to know the protocols necessary to establish communication between devices. So let’s continue with our next topic, Network Protocols.</p><h2 id=\"what-is-a-network-protocol\">What is a Network Protocol?</h2><p>As everyone knows, people around the world need to know common languages in order to talk to each other and transfer information to each other. Network also works in this way. The network enables communication between two devices, just like people, but first the two devices must be able to speak the same language. Devices in the network can only communicate and transfer information with each other if they use common protocols.</p><p>I will examine this issue in the OSI Reference Model, which I will cover in detail in my upcoming blog posts. Let’s continue without slowing down and move on to our next topic, What are Network Topologies?</p><h2 id=\"network-topologies\">Network Topologies</h2><p>It is the topology that determines how devices in a network are placed, how they are connected and how they transmit data. Today, it is used in two different ways. It is divided into two as Physical and Logical topology.</p><h3 id=\"what-is-physical-topology\">What is Physical Topology?</h3><p>Physical topology is the topology that determines how the network will physically look like. It determines how the devices and cables in the network should be organized.</p><h3 id=\"what-is-logical-topology\">What is Logical Topology?</h3><p>Logical topology utilizes physical topology to determine how data is transferred.</p><p>Network engineers need to consider these two topologies when designing a network and place devices and create the network according to these two topologies.</p><p>Today, the most widely used and known Network Topologies are the design models developed on five sequences. These models are used by network and system engineers in the required environments.</p><p><img style=\"text-align:center\" src=\"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/topologies.png\" /></p><p>As you can see in the picture, 5 different network topologies are shown. These are</p><ul>  <li>Bus Topology</li>  <li>Ring Topology</li>  <li>Star Topology</li>  <li>Tree Topology</li>  <li>Mesh Topology</li></ul><p>They are network configurations named as. The topologies here have pros and cons compared to each other. Let us examine them in order.</p><h3 id=\"bus-topology\">Bus Topology:</h3><p>In this topology type, communication between devices takes place on a single line. The data transferred on the network goes to all devices until it is transferred to the target device. For this reason, network performance is very low and is not widely preferred today. In addition, the communication type used on this topology is Ethernet.</p><p>This type of topology is very popular as it can be easily installed on the network. In addition, when an additional device is desired to be connected to the network, it can be easily added. It is economical, and it is possible to create a network without the need for external network devices such as switches or hubs.</p><p>However, every good thing has some disadvantages. In this topology type, the limited number of devices that can be connected and the limited line length are the main disadvantages.</p><p>In addition, in this topology, it is difficult to detect failures or errors in the systems installed on the backbone. In addition, when a problem occurs on the network, all devices connected to the network are affected. The data transfer rate is also low.</p><h3 id=\"ring-topology\">Ring Topology:</h3><p>In this topology type, the data sent on the network is transferred to all devices until it reaches the receiving device. Although it is logically ring-shaped, it actually has similarities with star topology. Although it is logically in the form of a circle, since it physically consists of devices connected to the MAU, it is logically analogized as a ring and physically as a star.</p><p>As with the bus topology, there are some advantages and disadvantages here.</p><p>The advantages are that all devices on the network have the same authorization and there is little performance degradation if a device is added to the network.</p><p>As disadvantages, a malfunction that may occur on a device connected to the network may cause the entire network to become unusable. It is also a very costly topology.</p><h3 id=\"star-topology\">Star Topology:</h3><p>Star topology consists of a hub or switch in the center and devices connected to it. In this topology, the data is logically sent to the hub or switch before the device from which the data originates. Then the data is transmitted to the destination device.</p><p>In this topology, if the network device called hub or switch at the center fails, the connection between the target computers from which the data originates and the target computers to which the data should be transmitted is broken. Ethernet protocol is widely used as a protocol. Devices can also be transmitted via fiber optic cables.</p><p>In this type of topology, network management and problem detection is easier, and it is also easy to add new devices. The biggest difference compared to the topologies I have mentioned so far is that a problem occurring in the destination or sender device does not affect the network.</p><p>As disadvantages, a problem in the intermediary network device in the center affects the whole network. It also requires more cable connections.</p><h3 id=\"tree-topology\">Tree Topology:</h3><p>In this topology, which we call tree topology, devices are connected to each other with two different connection points. This topology is often used to bring together networks in a star topology structure at an upper connection point. Thus, networks can be scaled up.</p><p>The advantages of this topology are that it is easy to reach each device and the segments they form. The device boundary of each intermediate topology is limited by the cable length. When backbone cables or central devices fail, the network is disrupted. It is difficult to install and organize.</p><h3 id=\"mesh-topology\">Mesh Topology:</h3><p>In this topology, a device connected to the network is connected to all other devices on the network. In this topology, if a problem occurs on one line, the device can maintain the connection through other lines. <br />As an advantage, this topology has the biggest advantage with its high data rate. In addition, when a new device is to be added to the network, it can be easily included.As disadvantages, the number of connections is high. Too many cables are used and the cost is high.<br /><br />After examining our last topology type, Mesh, we have finished the topics I planned for our first blog post today. Hope to see you in my next blog post.</p>",
            "url": "http://localhost:4000/basic-network-what-is-network-protocols-and-topologies",
            "image": {"path":"https://raw.githubusercontent.com/EyupErgin/eyupergin.github.io/main/images/basic-network-og.png","height":630,"width":1200},
            
            
            "tags": ["cyber","security","network","protocols","topologies"],
            
            "date_published": "2022-01-01T00:00:00+03:00",
            "date_modified": "2022-01-01T00:00:00+03:00",
            
                "author":  {
                "name": "Eyup Sukru Ergin",
                "url": "https://ergin.dev/about",
                "avatar": null
                }
                
            
        }
    
    ]
}